2	jokes
2	sascha
1	abused
2	defend
2	specific
2	work-in-progress
2	comparatively
2	retribution
2	béart
2	gotten
2	started
2	pour
3	penetrating
2	this
2	singles
2	brittle
3	luscious
1	deadeningly
2	hostages
2	christine
2	hashiguchi
3	appreciated
3	hipness
2	actioner
2	shades
1	mishandled
3	esoteric
2	yu
2	deadpan
2	decency
2	murphy
2	serendipity
2	motorcycle
2	throughout
2	lumpy
1	struggling
2	mercilessly
2	girl-on-girl
2	toes
2	animé
2	77
4	inspiration
2	reginald
2	acting
2	notch
4	exquisitely
1	imitations
2	malcolm
2	shelf
3	fans
2	pseudo-rock-video
2	magician
2	dennis
2	modern-office
1	sadists
4	ingeniously
2	bonding
2	shed
2	melodramatic
3	implicitly
2	sampi
2	extend
3	unflappable
2	starving
2	hinges
1	deathbed
2	blood-curdling
2	treatises
1	ultra-violent
2	pessimists
1	disconnects
2	filmgoing
2	planning
2	derry
2	slip
2	hustler
2	yo
2	brockovich
2	cross-shaped
2	roses
1	noisy
2	rumination
2	andy
2	memento
2	many
1	sickly
2	logistical
2	nyc
2	anything
2	matter
2	injuries
2	boxing
2	evaporates
2	unflaggingly
2	fragile
1	jackasses
2	qatsi
2	taxes
2	wladyslaw
2	souls
2	pabulum
4	crowd-pleaser
2	teen-oriented
2	dwarf
2	corn
3	wedding
2	puréed
2	knack
2	katz
2	tucker
3	flowering
3	wondrously
1	disconnected
2	region
2	with
2	title-bout
2	krige
1	staid
2	insecurity
2	witherspoon
2	foreman
2	unwillingness
2	louts
2	skolnick
2	embrace
2	rainbow
2	louis
1	miscasts
2	chaykin
0	pissed
2	movie-star
2	unnerving
2	accompanied
1	dragons
2	practically
2	spry
1	teen-sleaze
2	unmistakably
2	bladerunner
0	moldy
2	intimidated
2	ghoulish
2	done
1	misanthropy
2	amounts
2	heartstring
2	minutiae
2	murders
2	exploitive
2	ash
2	hooliganism
2	dime-store
2	expresses
1	fabricated
2	g-rated
2	preoccupations
2	willies
2	honoré
2	on-screen
3	passionate
2	absent
2	moaning
2	folk
2	binary
2	sentiment
2	ensnare
2	attitude
2	embellished
3	well-known
2	tar
2	rattling
2	sun
2	intuitively
2	probably
2	evokes
2	thuggery
2	table
2	arnold
2	clearasil
2	chemists
2	commend
2	endeavour
2	baggage
2	laurence
2	kinky
2	storylines
2	1933
2	cahill
3	consistency
2	ethan
2	riding
3	affectation
2	subtext
2	common
3	bends
2	shadings
2	melding
2	hayek
2	sushi
1	bloody
2	chocolate
2	mistakenly
2	raymond
1	worn
2	opaque
2	dewy-eyed
1	decrepit
2	mother
2	1915
1	yawns
2	existentialism
3	nijinsky
2	1970
3	resonant
2	bound
2	sexism
1	skeeved
2	weakly
2	finished
2	education
4	creative
2	contributed
2	twirling
1	frustrates
2	cockettes
2	clips
2	concerning
1	lacks
2	universe
2	lasts
1	simple-minded
3	tootsie
2	drumming
2	permutations
2	swan
2	violinist
2	morris
3	laughed
2	guided
2	simone
2	nary
2	bug-eyed
2	samuel
2	description
2	taiwanese
2	bugged
2	director-writer
3	handsomely
2	vies
2	third
3	symbiotic
2	spawned
2	aloft
2	j.r.r.
2	zen
2	every
3	terrifically
1	aground
2	deuces
2	jeanette
2	par
2	underutilized
2	agape
2	lovable-loser
2	schepisi
3	inventive
2	platitudes
2	comeuppance
2	neeson
1	b-movie
2	directress
2	tooled
2	step-printing
1	outdated
3	saved
2	pander
2	deploys
2	schizophrenia
2	scorn
1	unreligious
1	mel
2	addresses
1	disturb
3	luminary
2	breitbart
2	detract
2	merchant-ivory
2	honorably
2	pondering
2	bo
2	cogent
2	loosely-connected
2	arrives
2	snuggle
2	forster
2	aside
2	shankman
2	self-preservation
2	pythonesque
2	awhile
2	tissue-thin
2	snicker
2	spielberg
2	rally
2	christmas-tree
2	verite
2	build-up
2	big-bug
2	xiaoshuai
2	orange
3	anchoring
2	psychoanalytical
2	misadventures
2	emerge
2	breathe
3	legs
2	mohawk
2	chalk
1	slumming
2	pulled
2	playstation
2	realities
2	cram
2	date-night
2	considerably
2	kasem-furnished
2	reassembled
2	irwins
2	marketplace
2	unpredictable
3	all-star
2	glosses
2	gives
2	aidan
1	muddled
2	frankie
2	reminiscence
2	cash
2	pregnant
2	hidden
1	ailments
2	sorts
2	raptures
3	shrek
2	maelström
2	roller
1	ruined
4	career-best
2	pause
2	pursued
2	biscuit
2	martinet
2	tsai
2	borderlands
3	shiner
2	vs.
2	producers
2	festers
3	resonance
2	magnet
2	codes
2	mastering
2	filth
1	dysfunctional
2	views
2	disquiet
2	silver-haired
2	margin
2	giggle
2	interstitial
2	spoofing
2	spiritualism
2	reeses
2	pop-influenced
2	thirteen-year-old
1	grievous
2	installments
2	small-town
2	apart
2	structured
2	drown
1	confining
2	tomcats
3	meaty
2	jolt
2	accountant
2	olympus
3	definitive
2	sleeping
2	gong
2	schweiger
2	einstein
2	77-minute
2	seems
2	materials
2	zhuangzhuang
2	inhabited
1	yawn
1	haute
2	squeezed
2	g
2	reel
2	nuked
2	emerges
2	quite
2	age-wise
3	transparently
2	spliced
2	open-ended
2	recreates
2	otherness
2	pseudo-intellectual
2	san
2	physique
3	umpteenth
1	assert
2	94-minute
2	shearer
1	unsympathetic
4	awesome
2	stomping
2	serious-minded
2	yorkers
4	excellence
2	speedy
1	hodgepodge
3	contemplative
3	alexandre
1	substandard
2	stick
2	paucity
2	piles
2	realization
2	tension
2	laissez
2	pinks
1	shun
2	unrelieved
2	haplessness
3	cleansing
3	spell-casting
2	piesiewicz
2	double-pistoled
2	parmentier
2	vegetables
2	branagh
2	fortune
2	dramatizing
2	edited
2	minnie
2	sisterhood
3	greatest
1	made-for-tv
1	deception
2	2-day
2	explosions
2	escaping
0	unmemorable
2	50s
1	idiotically
1	lowbrow
2	romanticism
2	stormy
1	irony
2	in-jokes
2	ilya
3	comfort
2	bucket
2	sardine
2	talk
3	sidesplitting
2	documents
3	heart-rending
2	underwood
1	temperamental
2	merited
1	kill-by-numbers
2	heist
3	treasured
1	dicey
2	orthodox
2	went
2	even-handedness
2	scherick
2	byatt
2	costumer
2	hollywood-ized
1	sad
3	sense-of-humour
2	instilling
0	brainless
2	smarter-than-thou
2	dridi
2	published
2	highest
2	campion
4	magnificence
2	popped
2	conditioning
2	displays
2	coltish
2	prey
2	wary
2	indulge
2	tidings
2	mccrudden
1	tear-stained
2	norwegian
2	removed
2	bathos
2	undertones
4	top-notch
2	contain
2	relates
2	adorned
3	whole-heartedly
2	referencing
2	gaze
2	democracie
2	premier
2	hoot
3	donna
3	bombshell
2	re-enactments
2	whence
2	pretends
2	schlock
2	banged
2	colleagues
2	set-piece
2	shimizu
2	unceasing
2	a.i.
2	watch
2	extremists
2	sitcom
2	dispel
3	storytellers
1	garde
2	astronomically
2	japan
2	p.o.w.
0	errors
1	offended
2	brio
3	hailed
2	shedding
2	teen-driven
2	topping
2	hubristic
2	personifies
2	lifelong
1	fades
2	doris
2	angelina
2	self-regarding
1	difficult
3	fixating
2	sat
2	egomaniac
2	depression
3	independent-community
4	mesmerizing
3	giggling
3	rewarded
2	bon
2	cooly
3	revitalize
2	costner
2	orders
2	liberal
1	insultingly
3	high-energy
2	rethink
2	brendan
1	duds
2	sociologically
3	dumplings
2	permits
2	garbled
2	lumps
1	abysmal
2	coburn
2	riff
1	disintegrates
2	grains
2	yesteryear
2	curtain
2	renner
2	dispense
2	nonexistent
2	addressing
2	finger
2	10-year
2	tweener
2	sporting
1	monster-in-the
2	tuning
3	crowdpleaser
1	outshined
2	intrusive
2	barn-side
2	togetherness
2	celebrityhood
1	buggy
2	wazoo
2	fuel
2	zap
1	banal
2	near-hypnotic
2	double-cross
2	cremaster
2	challenged
2	hunnam
2	meatballs
3	inherently
2	1970s
2	jeffs
2	vega
3	mysterious
2	crosses
2	megalomaniac
2	amari
3	oscar-caliber
2	desmond
2	sober-minded
2	towering
1	loneliness
4	amazing
2	galore
2	inexorably
3	tickles
2	terrorists
2	negotiate
2	airy
2	mclaughlin
2	spaniel-eyed
2	predecessor
2	windtalkers
2	potatoes
2	improbability
2	reserving
2	pushes
2	whooshing
3	traditional
2	dotted
2	astringent
2	treacle
2	frei
2	adopts
2	potion
2	year
2	overwhelms
2	tinkering
2	immortals
4	encourage
2	hammer
1	stupidly
2	doctrine
1	soulless
2	rapidly
2	cards
2	middle
2	williams
2	based-on-truth
2	kitchen-sink
2	travelogue
2	bluster
3	glorified
2	enveloping
2	reigen
2	improbabilities
2	lights
2	laura
2	servitude
2	television
2	boasted
2	120
3	abundant
1	hollow
2	recognizes
2	craving
2	varying
1	hypocritical
3	fascinated
2	naipaul
3	ethics
3	affirm
2	voluptuous
2	lighting
1	fraught
2	demonstrate
2	instigator
2	bugsy
2	reflection
2	nurse
2	pretense
2	biography
1	shambles
2	signals
2	'til
2	talks
2	schultz
2	rivalry
2	ikea
2	destination
2	men
3	well-lensed
1	bewilderingly
3	live-wire
2	shoes
2	gain
2	awarded
2	melodrama\/character
2	churn
2	gore-free
1	prechewed
2	muster
2	manoel
2	greg
2	cashing
2	satirical
2	designs
3	easily
2	wertmuller
2	made-for-movie
2	deconstruction
2	ingest
2	narration
2	hobbled
2	vaudeville
2	columbia
2	heady
2	producing
3	immaculately
2	polemical
2	recruitment
2	helms
2	off-center
2	import
2	spell
2	barbara
3	won
2	salaries
2	ame
2	abstract
2	170
2	reptilian
4	better
2	prone
3	imaginable
2	hughes
2	in-joke
2	'30s
1	wading
2	viewer
2	magic
2	classified
1	untalented
2	bath
2	r&d
3	college
2	hallmark
2	swipes
2	recital
2	rendition
2	terminal
2	slogs
2	self-glorified
2	products
2	fate
3	frosting
2	millisecond
2	7th-century
3	dared
2	tougher
2	sound
2	sy
2	when
2	quicksand
1	hooting
3	colorfully
2	antic
3	contentedly
3	masterpieces
2	raging
2	globe
1	drain
2	advice
2	completely
3	wild
3	humour
2	tourists
2	fisher
1	questionable
2	ka
1	incompetent
2	1899
1	rotten
2	deportment
2	waltzes
2	transplanted
1	slopped
2	convey
1	turmoil
2	fear
2	charles
3	moved
2	hard
2	perception
2	jason
2	carnival
2	suspicion
2	levy
2	patent
3	skilled
2	desires
3	faced
2	incorporate
3	emphasizing
2	today
2	bank
3	strong
2	kilted
2	tattoos
2	nominated
3	uncomplicated
2	steers
2	democratic
2	pandered
2	involving
2	jovovich
2	univac-like
2	anna
2	comedian
1	lunacy
2	critics
2	alcoholic
3	teen-pop
2	eight
2	presenting
2	admitting
1	prejudices
2	sneaks
2	brit
2	stylings
2	technically
2	lent
3	cheerfully
2	lightly
2	nicolas
2	bumps
2	grumpy
1	petty
3	famous
2	seconds
2	hyperbolic
2	locals
2	jake
2	light-years
2	decrying
2	series
2	weighed
2	milking
2	chen
3	striving
2	butter
2	elude
2	encountered
2	heart-breakingly
2	somnambulant
2	seams
2	sla
1	sights
2	mixture
2	iceberg
2	husband-and-wife
1	oddest
2	jerking
2	hairs
2	pepper
2	relish
2	...
2	sympathies
2	believed
2	contributes
2	churning
1	armageddon
2	fuelled
2	creates
2	reeked
2	cat-and-mouser
2	rite
2	bob
2	bogdanich
2	wall-to-wall
2	dictate
2	freaky
2	griping
2	light-heartedness
0	disappointing
2	individuality
2	tremble
2	covering
1	discomfort
0	execrable
2	circuit
3	grownups
2	perpetual
2	veggie
2	stereotype
1	blown
2	not-quite-urban
2	quaid
2	vessel
2	gaitskill
2	deja
2	kok
2	integral
2	actorly
2	post-full
2	extensions
2	gobbler
2	culkin
2	ditched
2	gai
1	subzero
2	larger-than-life
2	own
3	girl-woman
2	textbook
2	waterlogged
1	wanders
1	surrealist
2	teen-exploitation
2	metaphorical
2	x-files
2	spousal
2	cream
2	biggie
2	works
2	playas
3	educates
2	war-ravaged
1	faux-urban
1	bludgeoning
2	twenty-three
3	meaningful
2	chelsea
2	walked
0	meaningless
2	steinis
2	four-hour
2	shoots
2	glimpses
2	specter
3	excruciatingly
2	emphasising
2	humanist
2	videos
3	vivacious
2	all-inclusive
2	seated
2	literature
2	looney
2	nonagenarian
1	force-feed
2	christians
0	grotesque
2	populace
1	abject
2	andrew
2	heartrending
2	drang
2	fidget
3	dream
2	evenings
2	8-10
2	soufflé
2	splits
2	miyazaki
2	flavor
1	plodding
2	dogmatism
2	liable
2	substitutes
2	frisk
3	whimsical
2	similarities
2	repelled
2	abel
2	club
2	serviceability
2	waster
2	stepmom
2	rather
2	divide
1	weakened
2	lisa
2	swathe
1	horrifyingly
2	and\/or
1	inconclusive
2	trailer
2	rembrandt
2	rudimentary
1	has-been
2	chilled
2	gifford
3	high-minded
2	unseen
2	everlyn
1	cheapening
2	meanest
1	diluted
1	dramaturgy
2	shakesperean
3	breathless
3	graduate
2	plucky
2	shapely
2	casual
1	dreaded
2	bowel
2	kazan
2	malediction
2	vanished
2	frighteningly
2	brainer
3	supercharged
2	stewart
2	place
2	signpost
2	january
2	matters
2	archive
2	jar-jar
1	preposterously
2	solondzian
2	sporadically
2	tiny
2	loads
2	hard-eyed
2	no-frills
2	straight
2	holmes
0	not-at-all-good
2	tov
2	grandparents
2	ballplayer
1	desiccated
2	satire
2	three
2	sooooo
2	them
2	stream
2	anxieties
2	lynch
2	exam
2	backhanded
2	steamboat
2	ineptitude
2	extraterrestrial
2	dreamscape
2	fetish
2	badly
2	imprimatur
2	dunst
2	incandescent
2	action-oriented
1	orgy
3	plotting
2	wordplay
2	stale
2	non-exploitive
2	funeral
2	ouzo
2	machines
2	elegiac
2	solely
2	crooned
2	blood-soaked
1	dud
1	churlish
2	outselling
2	restage
2	bratt
3	helpful
2	chords
0	tortured
2	gilligan
2	c.
2	qualls
1	intolerable
2	miles
2	terry
2	tasteless
1	irk
3	better-than-average
3	enlightened
1	bedroom
2	127
2	feminist
2	casting
2	fahrenheit
2	velma
1	wimps
2	gregory
3	dreamlike
2	1950s
3	serene
2	people
2	judges
2	vary
3	comradeship
2	stylized
2	jean-claud
3	fun-seeking
1	squashed
2	minus
2	setpieces
2	monopoly
2	meyjes
2	middle-brow
2	entertainments
3	irresistibly
2	farrell
2	foursome
2	tease
2	headly
2	concentrate
2	bale
2	choose
2	yasujiro
3	nourishing
0	soon-to-be-forgettable
2	tune
2	criticizing
2	gamble
2	prequel
2	relies
2	homeric
2	wince
4	phenomenal
2	stiller
2	manipulating
2	iv
2	trap
1	smarty-pants
2	iben
2	richard
2	rusi
1	scathing
3	intelligent
2	special-interest
3	excels
2	slim
2	george
1	horrors
2	world
3	life-altering
2	curio
2	first-time
3	philosophical
2	corniness
2	slanted
2	all-male
4	enrapturing
0	bibbidy-bobbidi-bland
1	all-wise-guys-all-the-time
2	confuse
2	hat-in-hand
2	terrifying
2	essence
2	gathering
2	same
2	existing
3	illuminating
2	ravel
2	belongs
1	soap-opera
2	liquid
2	unlock
2	superstitious
2	cart
1	buffoons
2	phoned-in
2	communal
2	clicks
2	pursuing
0	disdain
2	hard-core
3	supporting
2	nowhere
2	pax
2	breckin
2	doubt
2	closet
2	deliriously
2	carousel
2	perspective
2	wonder-what
2	traced
2	laying
1	distaste
2	over-the-top
2	capably
2	bleed
2	bodice-ripper
2	burdette
2	tenor
2	helm
2	existed
2	candy-coat
2	laptops
2	wrapped
2	destinees
2	spinoffs
2	endeavor
2	emergence
2	n
2	blowing
2	psychology
2	cuarón
3	participation
2	genre
3	piercing
2	sprinkled
3	adrenalized
2	slide
2	shared
2	actioners
2	extra
2	confessions
2	outbursts
2	cribbing
2	pet
2	shapable
2	negated
2	merge
2	joshua
2	message-mongering
1	unengaging
2	futuristic
2	arteta
2	center
2	anne
2	self-exploitation
2	snuck
2	charleston
2	dismantle
1	flee
2	resorts
2	pace
2	calvin
2	resists
3	beloved-major
2	leads
2	preferred
3	agreeably
2	reception
2	flower
1	ultra-cheesy
2	swords
2	depths
2	editing
2	attackers
2	faulted
2	pill
2	streetwise
2	preference
2	homework
2	unremittingly
2	softener
0	illness
1	hitler
0	worst
2	sylvie
1	second-rate
3	chris
2	contraption
1	flop
1	bumpy
2	griffin
2	days
2	fly-on-the-wall
2	teaches
2	response
2	alternative
2	büttner
2	exhibit
2	unsung
2	rent
2	fuels
3	lavish
3	cute
1	overmanipulative
3	beatings
1	thrown-together
2	bastions
2	free-wheeling
2	bmx
2	bed
3	thrilled
2	overpowered
2	criterion
2	dispatching
3	entertainingly
1	criticism
2	sven
2	evoking
2	schrader
2	itching
2	moon
2	respites
2	dingoes
2	hammily
2	without
2	bow
2	2001
2	scandinavian
2	felt
2	leader
3	chillingly
2	proverbial
2	rice
2	shatters
2	exposed
2	bodies
2	units
2	1.2
1	pillage
2	beach
1	tattered
2	arliss
2	nonethnic
2	tell
2	distill
2	curmudgeon
2	layer
2	occasions
2	mini
2	intimately
3	gifted
2	tel
2	submerged
2	dependent
2	envious
2	profit
2	perfunctory
2	regeneration
2	three-year-old
2	admitted
2	dues
2	percolates
2	bout
2	confirming
2	dustbin
3	geniality
2	repeatedly
2	georgian
3	world-class
2	forests
3	clarity
2	jews
2	reserve
2	serpent
0	painfully
1	sociopath
2	succinct
2	denver
2	70
2	oomph
2	fast
2	impatiently
1	ill-informed
2	confluence
2	males
3	reviewers
3	true-blue
2	gambles
2	parable
2	witnesses
2	plain
1	pokey
2	antonio
2	induces
2	suggesting
2	indigenous
1	minor-league
2	squabbling
2	gang
2	broader
2	ambiguities
2	hold
3	beer-fueled
2	telescope
2	roy
2	racial-issues
1	unhappily
2	boogaloo
1	undercuts
2	dearth
1	oblivious
1	desultory
2	packs
2	offsets
2	teenagers
2	gabriele
2	later
2	smuggling
2	ya
1	tendentious
2	veggietales
2	20
2	feardotcom.com
2	cows
2	oppositions
2	thrall
2	added
2	earn
2	learning
2	soderbergh
2	neglecting
2	testament
2	yvan
2	pics
3	spice
2	screamingly
2	parallel
2	marinated
1	copout
2	account
3	restore
2	responsibility
2	deconstructionist
2	deblois
2	banter
2	regis
2	seal
2	wolodarsky
2	aimed
3	member
2	include
2	school-age
2	suffice
1	piccoli
2	peanut
1	underdramatized
2	buildings
2	lavinia
2	hook-ups
2	languid
2	impersonation
2	soggy
2	borders
3	climactic
2	sportsmanship
2	$
3	poise
2	ill-conceived
2	wallet
2	akira
2	vim
2	time-switching
1	redundant
2	venice
2	obligations
4	extraordinarily
1	protagonist
2	contrary
2	goofy
2	reducing
2	inability
2	savoca
2	ghost
2	paying
1	dizzy
2	minutely
2	o2-tank
2	teetering
2	sunk
2	balances
2	elbowed
2	not-exactly
2	unrelentingly
2	watching
2	piscopo
2	romoli
1	less-is-more
1	excessive
2	e.t
2	board
2	bertrand
2	rachel
2	4\/5ths
2	reenacting
2	lad
2	berling
2	relic
1	unfunny
2	receiving
3	heartwarming
1	repressed
1	obvious
2	gibney
2	opera
3	blasts
2	4
2	politesse
2	tit-for-tat
2	peralta
2	agents
3	mystical
2	songbird
2	runteldat
2	schemes
2	toro
2	dustin
3	lovefest
2	skateboarder
1	prevents
2	descent
2	hypertime
2	end-of-year
2	feeling
2	idemoto
2	last-second
2	mojo
1	dishonesty
1	listless
3	robustness
2	jiang
3	consistent
1	indifferent
2	stalked
2	numbers
2	ii-birkenau
2	fascist
1	teeth-gnashing
2	trapped
1	rhetorical
2	shakespearean
2	church-wary
1	dangers
1	ghastly
2	households
2	goodly
2	li
1	outlandish
1	unelected
2	oodles
2	helpfully
1	unforgiven
2	rhino
2	steadfastly
2	opposites
3	liking
2	characterisations
2	retaining
2	equivalent
1	numbing
2	teenaged
2	irreverence
2	snatch
2	sychowski
2	vaguely
2	self-referential
2	intelligible
2	trappings
2	come
2	photos
2	livelier
1	flabby
2	p.t.
2	penis
2	fashions
1	shtick
2	narcissists
2	entangled
2	keeping
2	payback
2	hoffman
1	abusers
2	clown
2	agenda
3	heart-affecting
2	minded
2	sundance
1	ill-equipped
2	just-above-average
2	puportedly
2	pb
1	dry
1	weaknesses
4	liberated
2	paper
2	flirts
2	friggin
2	unhurried
2	figurative
2	slew
2	sandeman
1	unimpressively
2	gamely
2	shimmers
2	eye
1	shoot
2	speeds
2	murkiest
4	tantalizing
3	tingle
2	approaches
0	tortuous
2	neurotics
2	presented
2	maladjusted
2	anonymous
2	emotions
3	unleashes
2	documentary-like
3	abundance
2	nation
2	caustic
4	big-hearted
3	refused
2	blasphemous
2	strategy
2	holds
2	preliminary
3	bidder
2	em
2	lasker
2	on
2	lashing
2	humility
2	chiller
2	oliver
2	observer
2	shop
2	fusty
2	pursue
2	johnnie
3	resuscitate
2	smitten
2	1960s
1	off-season
2	vehicle
2	worrying
2	international
2	sentimentality
2	anti-semitism
2	shivers
2	conceive
2	psyches
2	diatribe
2	brett
2	child-centered
2	fingers
2	everett
1	un-bear-able
2	minac
2	filmmakers
2	close-up
4	shines
2	closed-off
3	theological
2	components
3	precise
2	split-screen
1	rapturous
2	chronicle
2	lux
2	reduced
2	player
2	cosby-seinfeld
3	delicate
2	motionless
2	upstaged
2	varies
3	ingenuity
2	laser-beam
2	niblet
2	tracts
2	locate
2	retina
2	actually
2	milestones
3	party-hearty
3	impress
2	proven
2	murray
2	rawness
3	cunning
3	distinguishes
2	violently
3	considerable
2	myself
3	ear-pleasing
2	1967
3	exuberantly
2	environment
2	rocks
2	toe-to-toe
2	investigation
2	hawaiian
2	meets-new
1	loopy
1	reeking
2	shut
2	sounds
4	confident
2	bros.
2	modernize
2	watson
1	plod
2	cut-and-paste
2	mason
2	shootouts
1	unstinting
1	havoc
2	sen
2	cutoffs
2	musicals
3	swashbuckling
2	directly
3	dynamited
2	middle-of-the-road
1	misconstrued
2	hardware
2	7.00
2	cultures
3	fit
2	insouciance
2	movie-industry
2	grounds
2	climb
2	surprise
3	invite
2	gone
2	assassin
3	down-to-earth
3	song-and-dance-man
2	curiously
2	deliberative
2	athletic
1	tries-so-hard-to-be-cool
2	belushi
3	glad
2	deceivingly
2	tempting
2	suspecting
2	shopping
2	discontent
2	even-toned
2	transparency
1	ordinary
2	decipherable
2	diminishing
1	depress
2	convolutions
2	novak
2	joins
2	sanctimoniousness
2	seduction
2	land-based
2	ecks
2	hearing
2	watstein
2	kafkaesque
2	pr
2	practical
2	overload
2	object
2	action\/comedy
1	old-hat
2	mile
1	bleak
2	undercurrents
2	harland
2	bentley
2	anti-establishment
1	b.s.
2	camera
2	steaming
0	exploitative
2	grabowsky
2	devoted
2	painting
1	nervous
1	thornier
2	accept
1	imitative
2	sending
3	flattering
2	avuncular
2	hanson
0	miserably
2	rapids
3	fantasies
2	diatribes
2	1998
2	potshots
3	frightfest
2	meeting
2	ruins
2	rejigger
1	whatever
2	building
2	depicted
2	numerous
3	ravishing
4	pretty
1	unentertaining
2	quibbles
2	wending
2	unsatisfactorily
2	late-twenty-somethings
1	name-calling
2	sheet
2	symptom
2	byways
2	agitprop
2	surefire
0	boredom
2	boldness
2	dodges
2	generated
2	146
2	drum
2	vulnerable
2	half-naked
2	star\/producer
3	greengrass
2	desired
2	salesmanship
2	they
2	anachronistic
2	11-year-old
1	omits
1	cardiac
2	divided
2	enron
2	jiri
2	ambitiously
1	offend
2	trees
2	pimental
2	45-minute
2	distraction
2	coven
2	directorial
2	potholes
2	cone
3	lively
2	hand-drawn
2	scribe
2	placeholder
2	junior
2	workman
1	yikes
2	ones
2	propensity
2	unity
4	well-structured
2	waydowntown
2	slovenly
2	seizing
4	effortless
2	each
2	towards
2	general
2	columbine
3	preschool
1	putters
2	simplicity
2	x.
2	fatter
1	defunct
2	mana
2	headed
3	intrigue
2	anyplace
3	team
2	plague
2	largest-ever
1	passive
0	disgusted
2	uncut
2	cake
2	endangered
2	dictates
2	researchers
2	boris
2	litmus
2	creating
2	digit
2	overdue
3	reign
2	chord
1	dwindles
2	specificity
2	cipher
1	wobbly
1	emptiness
2	brooklyn
1	pesky
3	evolves
2	hard-edged
2	categorization
2	thatcher
2	jesus
2	attendant
1	far-flung
3	enthusiastic
2	gambling
2	drug-induced
2	sucker-punch
2	chops
1	unacceptable
2	squirm
2	seeking
1	gawky
2	mamá
1	unrealistic
2	playbook
1	thankless
2	crosscuts
2	continued
2	blown-out
4	hope
2	analysis
1	lose
2	predator
2	vistas
3	consciousness-raising
2	antidotes
2	unaccountable
2	underlies
2	sontag
2	elder
1	disturbance
2	lightest
2	pretence
2	slice-of-depression
2	scene-by-scene
1	joylessly
1	tiresome
2	delayed
1	-lrb-
2	consigned
2	fluidity
2	produces
2	pretty-boy
2	wiel
2	bollywood\/hollywood
2	revel
2	aims
2	persistence
3	wizened
3	epic-horror
1	blubber
2	beacon
2	societal
2	norris
3	infectiously
3	impressionistic
2	linux
2	returned
2	bag
2	lascivious-minded
2	dollop
2	carpenter
2	representation
2	schoolgirl
1	groaners
2	bio-doc
2	reparations
2	kilner
2	bartleby
2	judaism
1	mismatched
2	surfacey
2	gear
3	expedience
2	conversation
2	episode
2	postmodern
2	subtitled
2	chabrolian
2	episodes
2	worker
2	chain
2	brazenly
2	mangle
2	blind
2	zishe
2	ringing
2	imparting
1	liar
2	defiant
2	pokes
2	firmer
1	botched
2	inertia
2	unprecedented
1	undeterminable
2	2 1\/2
2	collectible
2	burly
2	thievery
3	honesty
2	prolific
1	mind-destroying
2	sure-fire
2	agendas
2	quarters
2	quaking
2	xfl
2	stanford
3	michel
0	unsatisfying
1	alienated
2	age-inspired
2	unapologetically
3	champion
3	pubescent
2	trivialize
2	anywhere
3	ideal
2	exclamation
2	lugosi
2	rodriguez
2	hard-hearted
1	disjointed
3	otherworldly
2	decades-spanning
3	outshine
1	mean-spirited
2	jirí
3	aroused
2	imponderably
2	berkeley
2	shabby
1	stiff
2	pains
2	aggrieved
3	smoothes
2	twinkle
2	old-fashioned
2	dialog
2	adrift
2	harder
3	assuredly
2	fond
2	ably
2	frankness
2	laden
2	cor-blimey-luv-a-duck
2	mtv
2	libertine
2	directive
3	push-the-limits
2	turntable
2	emerged
1	confusing
2	nouvelle
2	racehorse
2	shoot-em-ups
2	racked
3	artwork
2	take
2	bald
2	balto
2	quasi-original
2	austen
3	surpassed
2	malle
2	low-down
2	inhale
2	deposits
2	marshaled
1	negligible
1	wheezing
0	undisciplined
2	showboating
2	sentences
2	appears
2	yep
0	snore-fest
2	gunplay
2	95-minute
2	along
3	sterling
2	lika
2	southern
2	roundelay
2	affectation-free
2	lodging
2	jettisoned
2	media
2	vices
3	benefits
3	grasps
2	stomach-turning
2	feelings
2	activism
2	broadside
2	sci-fi
2	lantern
2	appraisal
2	unknowing
2	maids
2	wiggling
2	amongst
3	bliss
1	fizzle
2	looseness
3	refreshingly
2	zaidan
2	criminally
2	marketable
2	dognini
1	unmentionable
2	shouting
1	low-life
2	exchanges
1	frittered
0	failure
2	disneyland
3	gritty
2	justify
2	nolden
2	touchy-feely
2	warm-blooded
2	boiled
3	exhilaratingly
2	director
2	lightning
2	pressed
2	examination
2	messages
2	saturation
2	tom
2	undressed
2	vagueness
2	female-bonding
4	honest
2	dunno
2	beached
2	sidey
3	refreshes
2	package
3	dedication
2	precedent
2	tend
2	marker
1	no
2	stir
2	awakening
1	wannabe-hip
2	calibrated
3	anchored
2	transporting
2	here
2	groupies
2	convictions
2	finishing
3	americans
2	reimagine
2	whale
2	stories
2	providing
2	hothouse
2	predisposed
2	laugher
2	devise
2	decorum
2	gall
2	25
3	satisfyingly
2	sought
2	nine
2	mined
2	buoyant
2	faraway
2	picpus
3	wink
2	interpersonal
2	münch
1	curmudgeonly
2	451
2	told
2	circus
2	hepburn
2	proper
2	found
1	gooeyness
2	glimmer
3	ballhaus
3	punchier
3	aspired
2	latifah
2	spine
2	pay
2	pa.
1	faltering
2	dabbles
2	oriental
3	promises
2	twenty-some
2	hamburgers
2	precollegiate
2	all-around
2	checking
2	reflections
2	microwaves
2	odd-couple
2	powder
2	boot
2	change
2	spanish-american
3	colorful
2	crystalline
2	clothes
2	roussillon
2	sleight-of-hand
3	dropped
1	slipshod
3	discoveries
2	expressly
3	gem
2	tay
2	water-bound
2	sell
2	guide
2	cuaron
1	rushed
2	there
1	bad-luck
2	sorrowful
2	lieutenant
2	chefs
2	hairpiece
2	egregious
2	judd
1	distended
2	teendom
2	stuffing
2	urinates
2	adversity
2	post-modern
3	energizes
2	sheridan
2	untugged
2	stop
2	dark
2	northwest
3	earthy
1	forgets
2	godfrey
2	trance-noir
2	sodden
2	video
2	labor
1	quick-buck
3	affectingly
2	jokester
3	surprisingly
2	mode
2	anatomical
2	survived
2	lucía
2	portrayal
2	alex
2	nash
1	image-mongering
3	jolting
2	narrator
2	'd
4	joyful
2	flashes
2	bohemian
3	chuckle
3	bright
2	dancers
2	originally
2	documented
1	hit-man
2	relays
2	26-year-old
2	alone
2	dogwalker
2	barris
2	evelyn
2	gaye
1	hostile
2	environmental
2	react
3	preferable
2	comprehension
2	chop
2	manifestations
2	formula
3	population
2	banking
1	awry
1	gasp-inducing
2	slapped
3	stimulating
2	mods
2	moody
2	prancing
2	act
3	unintentionally
2	g.i.
2	pummel
1	cliche-drenched
2	walter
2	deli
1	suffering
1	sleepless
2	cutesy
2	gremlins
2	efteriades
2	hemmingway
1	skunk
2	peaks
2	rintarô
2	being
2	defeat
1	small-budget
2	chronic
2	happens
2	proposal
2	sets
2	minutes
2	1993
2	israeli\/palestinian
3	exalted
2	grasp
1	oprahfication
3	bubbly
2	disappear
2	bleakness
2	apparent
2	hugh
2	windows
2	mcgowan
1	cliched
2	reinforces
2	disciplined
0	dreadfulness
2	passion
2	self-revealing
2	mulholland
2	unanswered
1	larceny
2	nachtwey
2	copenhagen
2	aquatic
2	easy
2	uncertainty
2	communism
2	circle
2	razzle-dazzle
2	self-examination
2	gunfest
1	pitifully
2	vh1
2	scandalous
2	strap
2	stretches
2	harris
2	denouements
3	pros
2	consolation
2	shoving
2	preordained
2	busts
2	croc
2	purists
3	filling
2	fore
1	distract
3	family
2	warp
1	no.
2	waged
2	bela
2	ramblings
1	puzzling
2	kahn
2	mounting
2	docu-drama
2	stealing
2	tobey
3	superior
1	befuddlement
2	ticks
1	endless
2	produce
2	georgian-israeli
3	lovely
2	apartheid
1	embarrassed
2	beginners
2	didacticism
2	liman
2	glide
2	mcklusky
2	tatou
2	terrain
0	stalking
2	high-end
2	max
2	generation
2	inhabit
2	dimensional
1	uncreative
1	undistinguished
2	miramax
1	typical
2	workshop
2	per
2	duke
2	enveloped
2	ilk
2	mechanical
2	monosyllabic
2	tian
1	discouraging
1	error
2	staging
2	videogame
0	valueless
2	partially
2	photography
2	jammies
2	epicenter
2	provocatively
2	rackets
2	flippant
2	ruthlessly
2	history
2	starters
2	shadyac
2	search
2	unprepared
2	fairies
2	plant
1	bleakly
2	final
2	moralistic
2	glint
4	excellent
2	surveillance
2	convince
3	myers
2	philosophically
2	stadium
2	prejudice
2	m.i.t.
2	deceptively
2	setups
2	c'mon
2	partnership
2	bridget
3	talent
2	open-endedness
2	prep-school
2	mosaic
2	lilia
2	socio-political
1	downing
2	sliding
2	experimental
2	ver
3	beguiling
1	hopeless
2	wasabi
1	hmmm
3	classic
2	equlibrium
2	timeframe
2	coupling
2	insistent
2	contrasts
2	goods
2	gender-bender-baller
2	cycle
2	slowly
2	ritchie
2	generalities
2	i
2	listening
2	rekindled
1	coldly
2	suppression
2	gaining
2	hit-and-miss
3	likableness
2	serenely
4	clever
2	dummies
2	recesses
2	changed
2	non-firsthand
1	indignation
2	kirsten
2	essay
2	barely
3	kidman
2	nap
2	impatient
2	wonderment
4	side-splittingly
2	banzai
2	concocts
2	outwardly
2	distinguish
2	gollum
2	joffé
2	errol
2	future
2	epps
2	exterior
2	fatalist
2	spades
2	continent
2	lily
2	doc
2	laugh-free
2	freshened
2	musclefest
2	hinge
1	foul-mouthed
2	turpin
2	truck-loving
2	rake
2	checklist
2	prepared
3	applaud
2	operates
2	zellweger
3	self-interest
2	ballast
2	1983
2	compulsively
2	jesse
3	well-acted
2	abroad
1	misogynist
1	overexposed
0	convoluted
2	hagiographic
1	confined
2	leaner
2	sanded
1	unjustified
2	petersburg
2	caste
3	me
3	depicting
2	loose-jointed
2	inquisitions
2	spiffing
2	glass-shattering
2	parables
3	expressive
2	workable
2	warrior
2	established
2	risks
2	cliques
2	smacks
2	leveling
2	pool
2	interests
2	rips
2	arthur
2	personnel
2	states
2	percentages
2	suggest
2	lewd
2	accessibility
2	clink
2	calculus
3	perceptive
2	hired
2	dares
2	awards
1	detracts
2	rez
2	greek
2	travil
2	forth
3	choreographed
3	love-struck
3	explorations
4	perfection
2	height
2	fearing
1	remains
2	moods
2	ceremonies
2	diop
2	stuttering
2	cuba
2	21\/2
2	glossy
2	stereotyped
2	social\/economic\/urban
2	maguire
2	scooping
2	mentally
2	demeo
2	patriarchal
0	idiots
2	sake
2	trade
2	corners
2	harry
2	neil
2	democracy
2	morgen
1	dumbed-down
2	adaptations
2	170-minute
2	concert
2	legends
2	swamped
3	anthropomorphic
2	fumbling
2	tinge
2	lurches
2	crawls
2	scatological
2	bluer
2	noticing
1	dizzying
2	ins
1	refuses
3	francophiles
1	mawkish
2	clinically
2	romp
1	unemotional
2	catch-22
1	demonic
2	listen
1	bottom
2	forte
2	mib
2	housing
3	metaphysical
3	delighted
2	zipper
3	handbag-clutching
2	sketch
2	eudora
1	discontented
2	senses
2	pelosi
2	socrates
2	answering
3	skillful
2	perceptively
2	rules
2	sturges
2	snowball
2	confines
1	grinding
2	paris
0	racism
1	all-over-the-map
2	flotsam
2	flex-a-thon
2	snowman
2	jags
2	sun-drenched
2	scotland
2	hitman
2	cafes
2	collide
2	clyde
2	byron
1	grossly
2	peploe
2	frissons
2	encompasses
1	castrated
2	inter-racial
2	digital-effects-heavy
3	asset
2	tactic
2	focused
2	review
2	principals
3	big-fisted
2	innocuous
2	makers
2	dock
4	embracing
1	cheapen
4	scintillating
2	composing
2	make
2	trip
4	exuberant
2	incinerates
1	misanthropic
1	weepy
3	effective
2	stein
2	75
1	autistic
2	blood-splattering
2	bill
2	rises
2	alchemy
2	también
2	plaguing
1	discursive
3	thus
2	concern
1	overloads
2	circularity
2	tenderly
0	trash
2	knee-jerk
2	boomers
2	pal
1	disintegration
1	dour
4	kickass
2	needs
1	vomit
3	guilt-free
2	solidity
2	owed
2	hyper
4	smile
1	bonehead
1	superficiality
2	gravitas
2	mullinski
2	damme
2	worldly
1	clashes
1	scorns
2	dolphin-gasm
1	chill
1	nudity
2	insists
3	spirit
2	fruition
2	random
2	full-throated
2	calibre
2	dexterous
2	weaned
3	serenity
2	european-set
1	static
2	enough
2	bears
2	packaged
2	pegs
3	movingly
2	relationships
2	fifth
2	beg
2	gangster\/crime
3	atom
2	israel
3	profits
2	self-absorption
2	seasoned
3	armenian-canadian
2	bus
2	decadent
2	heart
2	kidlets
2	nimble
2	quills
1	stereotypes
2	neorealism
2	gosling
2	preciseness
1	unreachable
1	wimp
2	iconography
1	restate
3	hard-won
2	stalk-and-slash
2	appropriately
3	frisky
2	daringly
2	kong
2	whip-crack
3	adept
2	phenomena
2	kurt
3	fearlessly
2	workaday
3	accentuating
2	vinegar
2	stars
2	inclusiveness
2	diabolical
2	demeanour
2	done-that
2	thanksgiving
2	sampling
1	problematic
1	over-dramatic
2	straight-faced
0	joyless
1	teeny-bopper
2	broadcast
2	idling
2	co-writer\/director
2	arcane
3	late-summer
2	boyd
2	demme
1	straight-to-video
1	absurdity
2	so-so
2	requiem
2	hyper-time
3	amuses
2	loopiness
1	gang-infested
2	snaps
2	tour
2	co-written
0	stupid
2	mamet
3	recapitulation
2	melted
2	shaggy
2	spotlights
2	tagline
2	arwen
2	'60s
2	sacrifice
2	filmgoers
2	sold
2	sticks
2	lending
2	exercises
2	scares
2	cadence
3	perfected
2	arriving
2	surface-obsession
2	ruinous
1	hyper-cliched
2	knowledge
2	picking
2	catechism
2	finder
2	festooning
1	long-winded
2	represents
2	tsukamoto
2	vain
2	bear
2	jell
2	peninsula
1	poorly
2	redgrave
2	cotton
2	splashed
1	improbable
2	smelly
2	rings
2	expose
2	globetrotters-generals
2	symmetrical
2	wish
2	picture
2	forbidden
1	dullest
2	dragged
2	tended
2	stimulates
2	guidance
2	maintains
2	right-thinking
2	canines
2	intrusion
3	glee
1	audacity
1	trudge
2	indicated
3	valedictory
2	wesley
2	calculations
2	professor
2	much
2	fastidiousness
2	twilight
2	lament
3	cliffhanger
2	maid
2	ransacked
2	quotient
3	brimming
2	back-story
2	non-god
2	acres
2	belief
2	sausage
2	ken
2	afterwards
2	assumption
2	butler
2	scouse
3	well-constructed
2	tickle
2	slightest
1	evaded
2	auteil
2	fisticuffs
2	snide
3	fulfilling
2	bushels
2	embodies
1	chloroform-soaked
3	theater
2	hollywood
2	infidelity
3	artsy
2	extras
2	sticker
2	action\/effects
2	shocker
3	danis
3	well-developed
3	able
3	muniz
2	superheroics
2	directs
1	rank
2	payoff
3	disagree
2	herrings
2	blanchett
2	ugly-looking
2	140
2	invincible
3	eye-opener
2	hawke
2	contorting
2	was
2	12
2	mortarboards
1	desert
2	gerald
2	wenders
2	flashbulb
2	descends
2	although
3	clutchy
1	myopic
2	involves
2	lothario
2	remembered
2	do
2	artist
2	judicious
0	zzzzzzzzz
2	strenuously
2	fryers
3	hard-driving
1	sudsy
2	hatfield
2	boosterism
2	makin
4	funniest
2	distilled
0	lynchings
2	fuses
2	computer-animated
2	oops
3	fab
2	forcefulness
1	overly-familiar
2	friendships
2	partway
2	assistant
2	luster
3	wide-eyed
2	shortest
2	jazzy
2	arkansas
2	candles
2	jelinek
2	face
2	presuppose
3	innovation
3	gusto
2	psyche
2	spare
2	undoubtedly
3	chilling
2	shanghai
2	distanced
2	nail-biter
2	conveys
2	whodunit
2	hyperbole
2	destiny
2	105
2	werewolf
2	anthology
2	stage
3	improvement
2	two-day
2	boat
1	mistaking
2	hanley
3	well-intentioned
2	oh-so-hollywood
2	casey
2	indie
2	psychic
1	fool
2	reactive
1	wincingly
2	japanese
2	pump
1	rant
2	few
2	father
2	injected
2	possession
3	well-meant
4	award-winning
2	errs
2	stagey
2	endings
2	minor
2	downy-cheeked
2	channeling
3	impeccably
2	girardot
2	completist
2	interpreting
2	hallways
3	self-importance
2	eyebrows
2	punchline
2	maternal
2	ducts
2	took
3	full-on
2	objects
1	unhappy
3	denuded
2	intentions
2	greek-american
1	deceptions
2	eminently
1	abuse
2	remind
2	classicism
2	ready
2	stifles
2	passions
2	soured
2	harmon
3	comprehensible
2	mall
2	ringside
1	wretchedly
2	booking
2	delete
2	avon
3	heart-pounding
2	domination
2	judith
1	jagjit
2	skin
2	unfold
3	toss-up
2	truffaut
1	imitation
3	nail-biting
2	resume
2	wait
3	cerebral
3	well-balanced
1	stalk
2	quotations
2	33-year-old
2	thematic
3	connecting
2	amini
2	von
2	perkiness
3	efficient
2	conforms
2	aliens
2	kidnapper
2	candor
3	fine
2	bar
2	slips
2	mandel
3	engross
2	yorker
2	homeboy
3	padding
2	toughest
1	lagging
2	lagoon
2	aristocrat
2	trey
2	doing
2	secondhand
3	romance
2	thoughts
2	preciously
2	spring-break
2	jules
2	restraint
3	laid-back
2	off-the-wall
1	awkward
3	fetching
3	segues
2	meditation
2	abandoned
2	deceptive
2	manipulative
2	deny
2	ideas
1	rigor
2	and
3	surprised
2	emigre
2	surroundings
2	warpath
2	napoleon
2	angels
2	geek
1	ill-starred
2	serbs
2	sugar-coated
2	outlet
1	schmucks
2	remembering
2	alfonso
2	facade
2	spangle
2	dialogue
2	plunges
2	lead
2	bible
2	tennessee
2	pull
2	boom
2	hollywood-action
2	needles
3	treasures
1	vapid
2	scorpion
2	ex-wife
2	ridiculously
2	stylist
2	spanning
3	grandness
3	trump
2	alliance
2	scarily
2	eyre
2	majorly
2	barbershop
2	masters
2	masquerade
2	flickering
2	showiness
2	chuck
2	168-minute
3	orgasm
2	d.w.
2	decrepitude
1	over-reliance
2	qualify
1	formuliac
2	rosario
3	exceeds
2	courtney
2	beside
2	true
2	wahlberg
2	randomness
2	founders
0	steals
2	dallas
2	knitting
1	sacred
2	initially
2	paid
2	lately
2	quibble
3	goofiest
2	dogma
2	newness
3	smile-button
1	inconsequential
2	james
3	romijn-stamos
3	gates
3	rekindles
1	cliche-bound
2	inquisitiveness
2	guy
2	raunch-fests
2	arnie
2	holden
2	persona
2	faceless
2	upends
2	bits
2	strands
2	lulls
2	seamy
2	classes
3	satisfaction
2	stymied
2	wizard
3	spreading
2	grandmother
3	revelation
2	gobble
1	reality-snubbing
2	electoral
2	apartments
2	leguizamo
2	rapes
2	spookily
1	weirdness
2	lines
2	devotes
1	horrified
2	unexamined
2	variety
2	rebel
2	something
2	reinforced
2	evident
2	triangles
3	rewarding
2	escaped
2	ben
3	dragonfly
2	eardrum-dicing
2	juwanna
2	abundantly
2	inanity
2	?!?
2	psychedelia
2	noxious
2	seldahl
2	cover
1	labored
3	wonderfully
2	r&b
2	wrestler
2	ismail
3	entrapment
2	lens
2	urbane
2	dramatist
2	over-amorous
2	burnt
3	disarmingly
2	bermuda
2	delicacy
2	theology
2	hare
2	singer-turned
2	utah
2	shares
2	delves
2	field-sized
2	juan
2	fizz
2	equally
3	fertile
2	trend-hoppy
2	femme
1	bombs
3	thrill
2	watered
2	omitted
2	ego
2	atlantic
2	flynn
2	borrow
2	journalist
2	prescient
2	84
2	cross-country
2	aristocrats
2	captive
2	brings
2	invested
2	find
2	grew
2	puppet
2	gender
2	portent-heavy
1	repetitively
2	homosexual
2	leftover
2	bullet
2	mehta
1	smallness
1	stains
2	market
2	their
2	by-the-book
2	cackles
4	exemplary
2	worlds
2	payola
2	austin
2	stationary
2	level
2	beause
2	heartstrings
2	debuter
1	rival
4	well-written
2	unnamed
2	revolve
2	humiliated
2	anniversary
2	joie
2	adorns
2	shakes
2	temerity
2	deciding
2	totally
2	provided
3	amazingly
2	burlesque
3	joys
3	shock-you-into-laughter
2	antlers
3	hero
2	composure
2	kjell
1	fiend
3	healing
2	pushing
2	sleeve
2	diversions
3	gender-provoking
2	vin
2	sub-tarantino
0	long-dreaded
2	teen
2	eileen
2	stranger
2	tacky
2	flesh-and-blood
2	stagy
3	swashbuckler
2	retreat
2	unrequited
2	party
2	wayne
2	forrest
2	20-year-old
2	skewed
2	krawczyk
2	admission
2	despite
2	decades
2	often
2	dirty-joke
3	gushing
2	diamond
2	hos
2	implausibility
2	dress
2	eat
2	time
1	do-over
1	messing
3	kafka
1	none-too-funny
2	finding-herself
2	sizzle
3	grade
2	testimony
2	ultra-provincial
2	ze
2	identity-seeking
2	doodled
3	dystopia
1	wedgie
2	anomie
3	clients
1	torture
1	bloodbath
1	shallowly
3	likes
2	heartache
2	inauspicious
3	patience
1	undernourished
2	precipitously
2	fringes
2	misfits
2	72-minute
2	stupefying
2	closure
0	wretched
2	cheer
2	skipping
2	hard-to-believe
2	pollyana
2	believes
2	aaa
2	teeming
2	bettany
2	scarcely
3	finest
2	sara
3	veracity
2	d.
3	affirming
2	scrappy
2	theatres
2	crystallize
1	zero-dimensional
2	palma
3	delightfully
2	taste
3	playwriting
2	fueled
2	segment
2	waldo
2	bunch
2	privates
2	communicating
2	spits
3	unparalleled
2	harps
2	got
2	malik
3	condensation
2	subdues
2	packages
1	victim
2	beresford
2	inspector
2	sats
2	susceptible
2	uncomfortably
2	dressed
2	takes
2	paper-thin
3	inspire
1	egotistical
1	bore-athon
3	exhilarated
2	encourages
2	cowering
2	novelistic
2	waits
3	poetically
2	israelis
2	anecdote
2	brush
1	tediously
2	rampling
2	send-up
2	nohe
1	fumbled
3	embraced
2	heated
1	nit-picky
3	multi-layers
2	joint
1	half-step
2	barriers
1	dead-eyed
2	mouse
2	helpings
2	claustrophobia
2	grandiose
2	comedy-drama
2	myth
3	ample
2	thou
2	walken
2	fleshed
2	intention
2	jackets
2	detachment
2	mistake
2	art
2	stand
2	savage
2	distorts
2	rapid
2	usher
2	treating
2	quitting
2	24-and-unders
2	prefer
2	assured
3	dominates
2	diverges
3	crossing-over
2	studiously
2	lds
3	optimistic
2	educational
2	corcuera
3	touchingly
4	riveting
3	unbreakable
2	puppets
2	welcome
2	puzzle
2	schneidermeister
2	stump
2	english-language
2	prepare
2	crawl
1	war
2	cary
3	amicable
2	campaign
2	verdu
2	broken
2	important
1	scuzbag
2	two
2	vittorio
2	years
2	hats
2	shafer
2	christian-themed
2	blondes
2	squaddie
1	sequel-for-the-sake
3	unerring
1	insignificance
2	crescendo
2	raps
2	davies
2	ended
2	uninitiated
2	uproar
2	procedure
2	coasting
2	transitions
1	after-hours
2	hmmmmm
2	koyaanisqatsi
2	mariah
2	improvise
3	fuzzy
2	vulakoro
1	over-indulgent
2	earnest
2	ferocious
3	undiscovered
2	limb
2	includes
3	10,000
3	humanize
2	beasts
2	withstand
2	mid-range
2	fallibility
2	memorial
2	carlito
2	88
2	effectively
1	trouble
2	during
2	affected
2	encounter
2	surround
2	ving
2	animator
2	frights
2	serves
2	mental
2	invites
2	single
3	reliable
2	truck
2	garnish
2	attentions
2	scherfig
3	relax
2	roll
3	1991
3	opulent
0	under-inspired
0	sloppy
2	gianni
2	payami
1	too-spectacular
2	prompting
3	skilfully
2	islanders
2	poodle
2	viveka
2	tomatoes
3	provocative
2	highlights
2	snapshots
2	cutter
2	grinds
1	too-facile
0	hideous
2	expansion
3	freshness
2	interpret
1	pinheads
2	scarface
2	legged
2	bogging
2	plan
2	neophyte
2	banger
2	everyman
3	correctly
2	sean
2	inquiries
2	carion
2	jackal
2	hardly
2	apes
2	juliette
2	funky
2	newcomers
2	homo-eroticism
2	tie-in
1	chopsocky
3	eighties
2	black-and-white
3	ihops
2	italics
3	jovial
2	participate
2	survive
2	ambience
3	rhapsodic
2	wanna
2	computer-generated
2	display
2	lucid
2	gazes
2	hanks
3	unhibited
2	seemingly
2	snickers
2	movie-going
2	overripe
1	endlessly
4	delight
2	mass-market
2	garry
2	lilo
3	blue-chip
2	physical
3	logistically
2	previously
2	cinema
2	accelerated
2	18th-century
2	eagerness
1	overwrought
2	discuss
2	mores
2	cannier
2	inevitable
2	feisty
3	wondrous
2	grow
2	movie-esque
2	still
2	australia
2	unedited
2	interference
2	irrepressible
2	rosenbaum
1	poor-me
2	keener
1	combatants
2	rat-a-tat
2	million
2	brother
1	hollowness
2	undermined
2	kahlories
2	boilerplate
2	baroque
1	shameless
2	low-key
2	retrospective
2	backrooms
2	galinsky
3	eye-filling
2	sag
2	seigner
2	mill
2	happily-ever
2	vicious
2	marxian
2	small-screen
2	low-wattage
2	spontaneity
2	humbling
2	al
2	patter
2	like-themed
4	miraculous
2	tautou
2	dualistic
2	singing
1	cheating
2	segal
2	labels
2	quickie
2	ontiveros
2	workout
2	traditions
1	incomprehensible
3	aspiration
3	redeemable
2	properly
2	and-miss
2	innumerable
3	spaghetti
2	entendre
2	moviemakers
2	hook
2	political-action
3	inside
2	tub
2	bennett
1	masochism
2	playlist
2	resents
2	87-minute
2	non-actors
2	11
2	brian
2	stare
2	internalized
2	canadians
2	resolute
4	impeccable
2	commiserating
2	instinct
2	mumbles
1	addict
3	grandly
1	distracts
2	wim
1	hated
2	neo-noir
1	collapse
2	marshall
2	wade
2	terrier
1	disgracefully
2	cape
2	cinephile
0	flounders
3	niches
2	farther
2	dreamed
2	actor\/director
2	quests
2	freudian
2	compass
2	borrows
2	nike
3	credulous
2	projector
2	noir
2	didactic
2	bronx
2	leplouff
2	trading
2	africa
3	loves
2	lowering
2	rates
2	culled
2	ellen
2	summer-camp
2	shortness
3	leatherbound
1	negatives
2	pays
3	splash
2	bearing
2	gratify
2	christina
2	showcase
2	housekeeping
2	annoyances
2	loosely
2	flesh
0	godawful
1	ate
3	uninhibited
2	rigged
2	microcosm
3	triumphantly
2	clothing
2	array
1	fuddy-duddy
2	left
2	opacity
2	illicit
2	blanks
2	reiterates
2	goes
2	immature
2	makhmalbaf
2	pedigree
2	recordings
1	disoriented
2	skyscraper-trapeze
2	foo
2	interrogation
2	distinctly
1	played-out
2	rat
2	padre
2	concludes
2	fury
2	plots
2	turturro
2	self-appointed
2	influenced
3	poetry
2	uncool
2	drawings
2	agency
2	paranormal
2	whaley
1	incongruous
2	long-lived
2	ever-growing
2	clooney
2	raucous
2	kramer
2	melds
2	cardboard
2	compromise
2	batting
1	maddening
2	farenheit
2	65-minute
2	timing
2	hallelujah
3	effecting
2	ascertain
2	unfolding
2	refusing
1	sedate
1	desperately
4	euphoria
2	wrought
2	cadness
2	champagne
2	stifling
2	fifteen
2	unsuspecting
2	gratuitous
2	advertised
2	skinner
2	schwentke
1	pathetically
2	day-to-day
2	suburban
1	mischief
2	writer-director
2	dankworth
3	morally
2	facing
2	african
2	teachers
2	costume
3	goodfellas
2	afternoon
2	martial-arts
2	unintentional
2	positions
0	ill-constructed
3	ethereal
2	blanket
1	obscurity
2	mugs
2	tick
2	cirulnick
4	well-meaning
2	fireballs
3	modestly
2	france
2	transpose
2	swear
2	suspect
2	read
2	pad
3	gutsy
1	let-down
1	padded
2	medem
2	unwise
2	sailor
2	values
2	different
2	customers
0	agonizing
2	slather
2	stagecrafts
2	gilliam
2	isabelle
2	censure
3	post-tarantino
2	narratively
2	opposed
2	african-american
2	rug
2	catharsis
2	weighs
2	1920
2	breach
4	topnotch
2	upholstered
0	uncompelling
3	regal
2	convinces
2	volumes
2	delirious
3	superstar
2	tongue-tied
1	abrasive
2	madonna
2	page
2	co-writers
2	phones
1	creeping
2	pillowcases
1	argues
2	self-satisfied
2	recyclable
2	haphazard
2	turned
3	greater
1	wannabes
2	completed
2	sequel-itis
2	franco
2	o'fallon
2	threat
2	minute-by-minute
2	goulash
2	near-impossible
1	retard
2	laser
2	leaks
2	female
2	lector
2	indie-heads
3	pops
2	scratching
1	uselessly
2	elusive
2	pie
2	tarkovsky
2	documenting
2	relishes
3	recommend
2	tummy
1	mess
2	dilemma
2	south
2	one-sided
2	avary
2	mountain
2	gluing
3	handheld
2	sturdiest
2	blaring
3	appreciate
2	boast
3	good-hearted
4	adored
2	ahem
2	interest
2	visions
1	self-righteousness
3	translates
2	stooges
2	93
2	thesis
2	extols
2	nuttiness
2	ante
2	sympathy
2	heather
2	these
2	pryce
3	greatly
2	compared
2	violates
2	a.
1	immaturity
2	gags
2	connoisseurs
2	dust
2	lyne
3	beautifully
2	tank
2	peas
3	articulates
2	drama\/character
2	gyllenhaal
2	quasi-improvised
0	abomination
3	dancing
2	ruffle
2	dolls
2	keenest
3	tasty
2	ryoko
2	catch
2	interdependence
3	exceedingly
3	spectator
2	macaroni
2	syrupy
2	reassuring
2	eternally
1	self-promotion
2	dismissive
2	communicate
3	parapsychological
1	laboriousness
1	hypermasculine
2	freebie
2	teams
2	applied
3	the-night
2	molony
1	squirming
2	pussy-ass
2	anciently
2	sob-story
3	veteran
1	crass-a-thons
2	beware
1	vacant
2	northern
2	made-for-home-video
1	inexpressive
4	masterpeice
2	swirl
2	molehill
3	flexible
2	interplay
2	expeditious
2	aplomb
1	suckers
3	glorifying
3	honoring
2	wallflower
2	lemon
2	bewitched
2	meander
2	orphan
2	pledge
2	placing
2	belgian
3	positive
2	configurations
2	poised
1	dithering
2	balancing
2	yanks
1	unsuccessfully
2	closer
2	shamelessly
2	debases
2	norma
2	impulse
3	anticipated
3	uplifter
2	muscle
1	spitting
2	stinker
2	elysian
2	mendes
3	follow-your-dream
2	ethos
2	accomplishing
2	fincher
2	punish
2	gathers
3	high-octane
2	inexplicable
2	freezers
2	patch
2	yong
2	doubts
2	clan
2	someone
2	allow
2	patiently
1	laughable
2	morph
2	two-hour
2	allows
1	failings
2	flatman
2	cineasts
1	unflinchingly
2	nrelentingly
3	emphatic
2	straddle
2	yes
1	trashy
2	solipsistic
2	wrists
2	east
2	straining
2	workplace
1	strays
3	life-changing
2	heck
3	lucks
2	dips
1	stupidities
2	schaefer
2	living-room
2	scenery
2	tranquil
1	farce
3	recharged
2	glue
2	settings
1	out
2	viscerally
2	delhomme
2	central
3	guilty-pleasure
3	respectable
1	arrested
2	park
2	pond
2	paycheck
2	fiendish
2	stand-up-comedy
2	runyon
2	middle-aged
2	screenwriters
2	rudd
1	patronizing
1	spiteful
2	accounting
3	pizazz
2	arbitrarily
2	redeems
2	thirty-five
1	subscriber
2	players
2	wisecracking
2	describes
3	funnybone
2	surveyed
2	whip
2	fuse
3	messenger
2	opens
2	posturing
2	spinoff
2	eroticism
2	eroded
1	putrid
2	stunts
2	remade
3	blissfully
1	cluelessness
1	slurs
2	trace
2	situations
2	families
2	italian-language
2	compromising
2	sermon
2	man
2	notorious
1	neglects
3	warmest
2	nature\/nurture
2	prolonged
2	sentimentalist
2	anti-catholic
3	bring
2	debate
2	bobbed
2	presentation
1	rigid
2	stallone
2	whole
2	englishmen
2	wisegirls
4	fabulous
2	co-director
1	beaten
2	completists
3	know-how
2	poet
2	chest
2	benevolent
2	subtler
2	community
2	choquart
3	connects
2	dynamite
2	pre-wwii
2	moldy-oldie
2	maneuvers
3	forgot
2	privileged
2	the-cash
2	dreyfus
2	maniac
2	discipline
2	h.g.
1	meager
2	peter
4	amusing
2	snake-down-the-throat
2	prose
1	errant
2	aspects
2	conjured
2	sandwiched
2	rests
2	underscoring
1	offal
2	undemanding
2	simultaneously
2	recompense
2	mum
3	head-turner
2	sharks
2	kidnapping
2	rafael
3	grandiosity
2	animatronic
2	already
4	recommended
2	bergmanesque
3	decides
1	crummy
2	motivation
3	metaphor
2	non-porn
2	cusack
2	montage
2	religion
2	aaliyah
3	certainly
2	postcard
2	crowd
4	oscar-nominated
2	impetus
2	actors
2	spend
2	beers
2	extortion
2	forceful
2	correct
2	emblematic
2	gliding
2	presiding
2	communicates
1	overinflated
2	peace
4	marvellous
1	screeching-metal
2	whenever
2	doggedness
3	scoob
2	delta
2	highfalutin
2	showgirls
3	regard
2	expressed
2	kilt-wearing
2	pouty-lipped
2	104
2	professionally
2	pta
2	sarah
2	students
2	point-to-point
2	suggested
2	down
2	tooth
2	informed
2	dominate
3	tenacious
2	dangerously
1	muddy
1	auschwitz
3	win
2	crawling
2	brooms
2	solved
2	claw
1	b-flick
2	round-robin
2	serrault
3	secretary
2	motives
2	jam
2	contest
2	respecting
2	gulp
2	trims
3	charmer
2	cradles
2	aboriginal
2	seventeen
1	bumbling
2	alarms
3	wore
2	ozpetek
2	campus
2	aspect
2	embody
2	willis
2	naiveté
2	val
2	four-year-old
2	colonics
2	wish-fulfilling
3	passionately
2	inversion
2	wins
2	view
2	bmw
2	portrays
2	mixing
2	suspension
2	rohypnol
2	magnolia
2	embedded
2	remained
2	triviality
2	viability
1	catastrophe
3	renown
1	unfulfilled
2	deem
2	father-and-son
2	orientation
2	altman
2	los
2	incognito
2	self-consciousness
2	guffaw
2	gloomy
2	ironies
2	contemplates
2	painterly
2	achilles
3	page-turning
2	videodrome
2	degrading
2	nuance
2	nostalgia
2	tailor
2	comments
2	singularly
2	soap
2	coherence
2	road-and-buddy
2	worship
2	front
1	neo-fascism
2	concentrates
3	overflowing
2	colonel
2	pitched
2	onscreen
2	parrot
0	bruised
1	falters
2	water-camera
2	followed
2	mediterranean
1	dulls
2	merely
2	ooky-spookies
3	bonus
1	inactive
2	inflate
2	cash-in
2	notations
1	deafening
2	gloss
2	learned
2	colgate
1	unadorned
2	focus-grouped
2	teen-targeted
2	oo
2	applies
2	morgan
2	brothers\/abrahams
2	waves
2	animals
2	sledgehammer
3	leftovers
2	experimentation
2	indulgently
2	nonbelievers
2	tunnel
2	14-year-old
2	publishing
2	characterization
2	uproarious
2	brat
3	lewis
2	piss
1	wishy-washy
2	kev
2	26-episode
3	pleasantly
2	playboy
2	sensuous
2	relocation
2	journalistic
3	dreamy
0	humorless
3	succeeded
2	australian
2	sheer
3	versace
2	pierce
2	idealistically
2	tackles
3	introduces
3	enriched
2	camp
2	or
2	hookers
2	k.
3	hilarity
2	dubbed
2	still-inestimable
2	stevenson
2	minimal
2	frontier
2	costumed
2	trolls
2	property
4	humor
2	matchmaking
3	dynamism
2	sade
1	nightmares
3	bravery
2	monte
2	unnecessary
2	strip-mined
2	dim
1	angry
2	publicist
2	plainly
2	spark
2	minimum
1	least
2	spill
1	unlistenable
2	eye-boggling
2	thrown
2	backmasking
2	tunis
2	naïve
2	study
2	time-killer
2	testing
3	virtuoso
2	slash-dash
2	rollerball
2	continually
2	erin
2	dungpile
2	musketeer
2	pages
2	factors
2	ripping
2	inseparable
2	convolution
1	dark-as-pitch
2	discover
2	inkling
2	adopt
2	olives
2	obsessions
2	josef
2	actress
2	anchors
2	derisions
2	influences
3	pleasingly
2	falsehoods
1	inconsistencies
2	echelons
2	luther
2	overly
2	creators
2	scrooge
1	dahmer
2	combine
2	squander
3	morning-glory
2	whirling
1	ineffective
2	slavery
1	turgid
2	stirs
2	outlandishness
2	cup
2	tied
1	egocentricities
2	swank
2	strangling
