2	it
2	's
2	a
3	lovely
2	film
2	with
2	performances
2	by
2	buy
2	and
2	accorsi
2	.
1	no
2	one
2	goes
2	unindicted
2	here
2	,
2	which
2	is
2	probably
2	for
2	the
4	best
2	if
2	you
2	're
1	not
2	nearly
3	moved
2	to
1	tears
2	couple
2	of
2	scenes
2	've
2	got
2	ice
2	water
2	in
2	your
2	veins
3	warm
3	funny
4	engaging
2	uses
3	sharp
4	humor
2	insight
2	into
2	human
2	nature
2	examine
2	class
1	conflict
2	adolescent
2	yearning
2	roots
2	friendship
2	sexual
2	identity
2	half
2	submarine
2	flick
2	ghost
2	story
2	all
2	criminally
1	neglected
3	entertains
2	providing
3	good
3	lively
2	company
4	dazzles
2	its
2	fully-written
2	characters
2	determined
3	stylishness
1	-lrb-
2	always
2	relates
3	-rrb-
2	johnny
2	dankworth
2	soundtrack
2	years
3	visually
4	imaginative
3	thematically
3	instructive
2	thoroughly
4	delightful
2	takes
3	us
2	on
2	roller-coaster
2	ride
2	from
2	innocence
2	experience
2	without
2	even
3	hint
2	that
1	typical
2	kiddie-flick
2	sentimentality
2	nothing
2	at
2	stake
2	just
2	twisty
2	double-cross
2	can
2	smell
2	mile
2	away
2	--
2	still
3	derivative
2	nine
2	queens
2	lots
4	fun
1	unlike
2	speedy
2	wham-bam
2	effect
2	most
2	hollywood
2	offerings
2	character
2	development
2	more
2	importantly
3	empathy
2	heart
2	italian
2	beginners
2	'll
3	gasp
0	appalled
3	laugh
1	outraged
2	possibly
2	watching
3	spectacle
3	promising
2	young
2	lad
2	treading
1	desperately
0	nasty
2	sea
2	shed
2	an
1	errant
2	tear
2	band
2	courage
2	face
2	official
1	repression
3	inspiring
2	especially
2	aging
2	hippies
2	this
2	included
2	although
2	german
2	cooking
2	does
2	come
2	readily
2	mind
2	when
2	considering
2	world
2	cuisine
2	mostly
2	martha
2	could
2	make
3	deutchland
3	popular
2	destination
2	hungry
2	tourists
3	beguiling
3	splash
2	pastel
2	colors
2	prankish
3	comedy
3	disney
2	as
2	surreal
3	dream
3	detailed
2	photograph
2	dexterous
2	times
3	imaginatively
1	overwhelming
2	lawrence
3	bounces
2	over
2	stage
3	dancing
2	running
2	sweating
2	mopping
2	his
2	generally
2	displaying
2	wacky
3	talent
2	brought
2	him
2	fame
2	first
2	place
2	serves
3	valuable
2	time
2	capsule
2	remind
0	devastating
1	horror
1	suffered
2	entire
2	people
2	what
2	surprising
2	about
3	full
2	frontal
2	despite
2	overt
2	self-awareness
2	parts
2	movie
2	manage
2	break
2	past
2	artifice
3	engage
2	whether
2	like
2	rap
2	music
2	or
1	loathe
2	ca
2	n't
2	deny
2	either
2	tragic
1	loss
2	two
2	men
3	prime
2	their
2	power
2	...
2	otherwise
3	intense
3	twist-and-turn
3	thriller
3	certainly
2	should
1	hurt
3	talented
2	gaghan
2	resume
3	provides
4	grand
3	intelligent
3	entertainment
3	superior
2	cast
2	playing
4	smart
2	amid
3	compelling
2	plot
2	there
4	tremendous
3	energy
2	sense
2	playfulness
3	excitement
2	seems
3	appropriate
2	moves
2	quickly
2	adroitly
2	fuss
2	;
3	give
3	reflect
2	inanity
1	cold
1	war
2	datedness
2	premise
2	deep
3	meaningful
2	welcome
2	breeziness
2	some
2	unbelievably
4	hilarious
2	moments
2	portraying
1	idiocy
2	industry
2	worth
2	trip
3	remarkably
3	solid
2	subtly
2	satirical
2	tour
2	de
2	force
2	enormously
4	entertaining
2	moviegoers
2	any
2	age
4	poignant
4	artfully
3	crafted
2	meditation
2	mortality
3	rarity
2	among
2	recent
2	iranian
2	films
2	:
3	gentle
2	chides
1	absurdity
1	protagonist
2	plight
2	only
2	undercover
2	brother
2	so
2	than
2	both
2	austin
2	powers
2	but
2	also
3	smarter
2	savvier
3	spoofs
2	along
2	way
2	feels
2	breath
4	fresh
2	air
2	those
2	allow
2	woody
2	allen
2	latest
2	ambling
2	broad
4	love
0	hate
2	biz
4	stunning
2	lyrical
2	work
3	considerable
3	truth
0	inhospitability
2	land
2	emphasizes
2	spare
3	precision
2	narratives
2	helps
2	them
2	atavistic
2	they
2	were
2	tales
2	had
2	been
2	handed
2	down
2	since
2	beginning
2	næs
2	directed
2	version
2	elling
2	gets
3	fine
2	leads
2	who
3	originated
2	coda
2	every
1	pinochet
2	case
2	splits
2	between
2	minute-by-minute
2	account
2	british
2	court
2	extradition
2	chess
2	game
2	regime
2	talking-head
2	survivors
2	mike
4	winner
2	kids
2	doubt
2	lil
2	bow
4	wow
2	now
3	add
2	movies
1	list
2	things
2	he
3	well
2	t
2	belgian
2	fable
2	very
2	much
2	own
2	droll
3	delicate
2	little
2	has
3	touching
2	say
2	important
3	life
2	why
2	yet
2	another
2	studio
2	franchise
2	mucking
2	up
2	storyline
1	glitches
2	casual
3	fans
2	correct
1	sleep
1	taken
3	stylish
3	energetic
2	one-shot
2	queen
1	damned
2	be
2	said
1	suck
2	wo
2	roger
2	will
2	recognize
2	big
2	part
2	we
2	go
2	while
2	stoically
2	delivered
2	hokum
2	hart
2	never
4	worthy
2	addition
2	growing
2	canon
2	post-saving
2	private
2	ryan
2	tributes
3	greatest
2	generation
2	know
2	crazy
2	held
2	my
2	interest
2	start
2	finish
2	sober
2	affecting
2	chronicle
2	leveling
2	fast
2	highly
3	enjoyable
3	celebration
2	quirkiness
2	eccentricity
3	certain
2	individuals
2	'
3	tendency
2	let
2	hang
1	out
1	damn
2	consequences
2	writer\/director
2	joe
2	carnahan
2	grimy
1	crime
1	drama
1	manual
2	precinct
2	cliches
2	enough
2	cover
1	clunky
2	dialogue
2	lapses
2	logic
3	witty
2	follow-up
2	ideas
2	techno-saturation
2	are
2	far
3	novel
2	presented
2	wry
2	dark
3	infectious
3	cultural
3	tasty
2	balance
3	family
2	frenetic
2	occasionally
1	static
2	point
2	resembling
2	play
2	delivers
2	mixture
3	sweetness
3	laughs
4	honest
2	look
2	community
3	striving
2	anchor
2	itself
3	new
2	grounds
3	hat
2	head
2	clooney
2	director
2	building
2	slowly
2	sporting
2	breezy
2	spontaneity
3	realistically
2	drawn
2	characterizations
2	develops
2	significant
2	study
3	moving
3	wise
2	ultimately
1	empty
0	unsatisfying
2	swallowing
2	communion
2	wafer
2	wine
3	chilling
3	well-acted
3	finely
2	david
2	jacobson
1	dahmer
3	swashbuckling
2	tale
2	betrayal
2	revenge
2	above
2	faith
2	ever
3	becoming
2	didactic
3	carlos
1	carrera
3	expertly
2	weaves
2	novelistic
2	entangled
2	interrelationships
3	complex
2	morality
2	coming-of-age
2	seen
2	bits
2	other
2	rarely
2	told
2	such
3	grace
2	specificity
4	literate
2	presentation
3	wonderfully
1	murderous
2	event
2	1873
1	rage
2	2002
3	makes
1	claustrophobic
2	on-board
2	quarters
2	seem
3	respectful
2	byatt
4	hope
2	though
2	lovers
2	book
2	may
3	wonder
2	necessary
2	year
2	exploration
1	obstacles
4	happiness
3	faced
2	five
3	contemporary
3	psychological
4	masterpiece
2	beneath
2	surface
2	reconfigured
2	asks
1	disturbing
2	questions
2	expect
2	military
3	epics
2	stevens
3	glides
2	through
2	broomfield
2	turns
3	distinctive
2	`
1	blundering
2	style
2	something
2	really
2	help
2	clear
2	against
2	odds
3	heaven
0	hell
1	creeped
3	me
3	refreshing
2	see
2	girl-power
2	feel
2	prove
2	anything
2	seeing
2	basis
3	wisdom
2	startling
3	optimism
3	children
1	rigorously
2	structured
4	exquisitely
2	filmed
2	father
2	son
2	connection
2	brief
1	shooting
2	star
3	gilliam-esque
1	troubling
2	interpretation
2	ecclesiastes
3	rewarding
2	art
2	patient
2	challenge-hungry
2	quiet
3	treasure
3	savored
2	series
2	assured
4	thrilling
2	abundantly
3	phenomenon
2	once
2	again
3	reinvented
2	spanish
1	withering
2	effects
1	jealousy
2	monarch
2	whose
2	passion
2	her
2	husband
2	becomes
2	obsession
2	huston
2	nails
2	glad-handing
2	choking
1	hollow
1	despair
2	have
2	generated
2	many
2	sparks
3	affection
2	astoria
2	given
3	glow
2	delirious
2	female
3	orgasm
2	nuanced
2	mood
1	tics
1	chamber
3	superbly
2	acted
2	deeply
3	appealing
3	veteran
2	bouquet
2	quite
2	berling
3	fascinating
2	how
2	bettany
2	mcdowell
1	off
2	each
3	beautifully
2	mounted
2	issues
2	managing
2	walk
2	line
3	regard
2	question
2	joan
2	madness
2	leigh
4	memorable
2	top
1	bottom
2	moviegoing
3	pleasures
2	jose
2	campanella
2	loosely
2	autobiographical
2	brushed
3	brimming
3	bittersweet
2	pathos
2	lyric
2	linger
2	snapshots
2	memory
2	clockstoppers
3	fulfill
2	wildest
3	fantasies
2	being
2	different
3	kind
2	traveler
3	happily
2	killing
2	94
2	minutes
4	beautiful
2	behold
3	engages
3	epic
1	struggle
2	inner
2	outer
2	too
3	rare
2	hastier
2	productions
2	neither
2	parker
2	nor
2	donovan
2	romantic
2	lead
3	bring
2	quirky
3	charm
2	formula
2	emotional
2	journey
2	shyamalan
2	gibson
2	stepping
2	bruce
2	willis
4	perfect
2	actor
2	take
3	special
2	narrative
2	flow
3	improved
2	daniel
2	radcliffe
2	emotionally
3	assertive
2	around
2	harry
2	conjures
2	magic
2	author
2	j.k.
2	rowling
2	books
2	jaglom
2	put
2	s
2	audience
2	privileged
2	position
2	eavesdropping
2	observed
2	miraculously
1	unsentimental
2	comedy-drama
4	must-see
2	mamet
3	enthusiast
2	anyone
3	appreciates
2	moviemaking
1	crackerjack
2	nonstop
3	romance
2	suspense
2	action
2	acting
2	costumes
2	cinematography
2	sound
3	astounding
2	production
2	austere
1	locales
3	ambitious
2	trivial
2	cash-in
2	features
2	nickelodeon
2	made
2	animated
3	tv
2	definition
2	small
2	stone
2	sprecher
3	gripping
2	searing
2	portrait
2	lost
2	soul
2	trying
2	find
2	suffers
2	lack
3	comprehensible
2	visual
3	treat
2	almost
3	unsurpassed
1	unassuming
4	pure
3	warmly
2	extend
2	arms
1	yell
2	safe
2	!
3	intriguing
3	cinematic
2	omnibus
2	round-robin
3	interesting
2	concept
2	execution
3	refreshingly
2	incisive
2	grant
3	appeal
2	guys
2	girlfriends
1	drag
2	hugh
2	factor
2	so-called
3	real
2	live-action
2	cartoons
2	cartoon
2	knows
2	form
2	history
2	lies
3	mysterious
2	spring
2	richness
2	hoffman
2	notches
3	nuances
2	pain
2	edgy
2	voice
2	waddling
2	profile
3	emphasized
2	accent
2	wilson
3	saves
2	drippiness
4	better
2	message
2	thyself
2	women
2	size
3	receive
2	?
2	second
2	coming
2	potter
2	predecessor
3	successfully
3	crushes
2	selling
2	timeframe
2	mandates
0	avoid
2	godzilla
2	sized
2	soda
2	84
2	rolling
2	musical
2	back
2	beat
3	supercharged
2	warfare
2	clearly
4	great
3	beauty
2	baseball
2	melds
3	touch
2	regardless
2	familiarity
2	sport
2	seldahl
2	barbara
3	precise
2	someone
2	turned
2	upside
2	then
0	illness
2	realistic
2	byler
2	reveals
2	intrigues
3	fascinates
2	reduces
2	situation
2	simple
2	melodrama
2	potentially
0	forgettable
1	strangely
2	diverting
2	bogdanovich
3	tantalizes
2	offering
2	peep
2	show
2	lives
2	era
2	creme
2	la
2	celluloid
2	cinema
3	finest
3	higher
2	level
2	pulls
2	gives
3	hero
1	suffering
3	triumphs
3	share
2	surrounds
2	sends
3	theater
2	feeling
2	shared
3	adventure
2	manages
3	transcend
3	sex
2	drugs
2	show-tunes
2	richer
1	dense
2	contains
2	lapaglia
2	ability
2	convey
2	grief
2	works
2	weaver
2	sensitive
3	reactions
2	two-actor
2	master
3	reign
1	fire
2	looks
2	was
2	thought
2	watched
2	altogether
4	successful
2	same
2	reconsideration
2	familiar
2	root
2	clara
2	paul
2	perhaps
2	emotion
2	closer
1	pity
3	hit
2	theaters
2	field
2	dreams
2	instead
2	hyperbolic
2	beat-charged
2	urban
2	western
4	unpretentious
2	sociologically
2	pointed
2	slice
2	tunes
2	man
2	across
2	centuries
2	count
2	monte
2	cristo
2	transform
2	caviezel
2	rigged
2	ago
2	d
2	oes
2	bother
2	cloying
1	preachy
2	equivalent
3	evangelical
3	christian
2	maybe
2	filmmakers
2	likely
2	already
3	faithful
2	tolerable
2	diversion
1	suffices
4	triumph
2	however
2	michael
2	dowse
2	superficially
2	understands
2	hold
1	contempt
2	taste
2	runs
1	difficult
3	absolutely
1	miss
2	screen
2	before
3	americans
2	beings
3	leon
0	frustrating
2	oddly
3	likable
2	okay
2	surely
3	classic
2	upon
2	based
2	stomach
1	rough
3	content
2	checking
2	alone
2	looking
2	aristocratic
4	luminous
2	careworn
2	jane
2	hamilton
4	exemplary
2	rampling
2	performance
2	mafia
2	stars
2	hood
2	rats
2	butt
1	ugly
2	heads
1	regurgitation
0	violence
2	brutal
2	birth
2	unlikely
2	tricky
3	topic
2	tadpole
2	step
3	right
2	direction
2	blend
2	frankness
2	civility
2	compassion
2	flip
0	terribly
3	hip
2	bit
2	montias
2	pumps
2	lot
3	nicely
2	himself
2	stereotyped
2	street
2	falls
3	neatly
2	category
0	stupid
1	tedious
2	russian
2	ark
4	mesmerizing
2	continued
2	chemistry
2	carmen
2	juni
2	keeps
2	slightly
0	disappointing
2	sequel
2	going
4	amusing
2	banter
3	blessedly
2	curse-free
2	keep
2	parents
4	entertained
2	reggio
2	continual
2	barrage
3	absorbing
3	thought-provoking
1	unfortunately
2	appears
2	jackie
2	chan
3	influence
3	starting
2	hong
2	kong
2	adds
3	gorgeous
2	sprawling
3	swashbuckler
2	diversions
3	uncomplicated
2	fashion
3	overwhelmingly
2	cogent
2	kissinger
2	calculating
2	criminal
2	sade
1	controversial
2	eponymous
2	fiercely
1	atheistic
2	elliptical
2	kinnear
2	aim
2	our
2	sympathy
2	rather
3	striking
2	skill
2	depth
3	subtle
3	strength
2	``
2	''
1	loses
2	reality
2	grim
2	shades
2	gray
2	maneuvers
2	format
2	used
2	capture
1	dizzying
2	heights
3	achieved
2	motocross
2	bmx
2	riders
2	balletic
2	hotdogging
2	ends
2	bone-crushing
1	screwups
2	virtues
2	eastwood
2	uncommercial
2	jeffrey
2	serial
1	killer
2	become
1	redundant
2	major
2	kudos
2	actually
2	casting
2	working-class
2	deserves
2	passing
2	events
2	shaping
2	beyond
3	horizons
2	reminds
4	exciting
4	satisfying
3	fantasy
2	approached
3	imagination
2	flair
2	thanks
2	scott
3	charismatic
3	eisenberg
4	sweet
2	nephew
2	dodger
2	variations
2	frighteningly
3	capable
2	debut
2	genre
2	piece
2	snapshot
2	dangerous
2	political
2	verge
2	scene-stealing
2	wit
2	wolfish
1	pessimism
2	anna
2	chancellor
2	weddings
2	funeral
2	amuse
2	provoke
3	adventurous
2	adults
2	specialty
3	venues
2	do
3	appreciate
3	easygoing
2	finding
2	god
3	accessible
2	marrow
2	niro
2	digs
2	because
2	stirred
4	powerful
3	co-stars
2	snags
1	stumblings
2	compensated
3	wryly
1	subversive
2	tone
3	inside
2	conflict-powered
3	decent
2	moral
2	get
2	tension
3	seat
2	affleck
2	jackson
2	sparring
2	partners
2	old-world
2	-
2	meets-new
2	mesh
2	incarnated
4	joyful
2	effusion
2	disco
2	bollywood
2	end
2	monsoon
3	wedding
2	sent
3	spirit
2	soaring
2	effectively
1	creepy
2	fear-inducing
2	fear-reducing
2	japanese
2	hideo
2	nakata
2	superstitious
1	curse
2	chain
2	letters
2	applies
2	having
2	actors
2	speaking
4	adored
2	movie-going
2	public
2	khouri
4	terrific
3	well-crafted
2	chiller
2	under
2	red
2	bridge
2	explores
2	connections
2	sexuality
2	laced
2	few
3	fanciful
2	touches
2	serious
2	living
2	dumas
2	adaptations
2	likened
2	lengthy
2	jail
2	sentence
4	delectable
2	filled
3	surprises
2	read
2	lips
3	original
2	misfits
2	stand
2	chance
2	together
4	magnificent
3	highbrow
2	self-appointed
2	guardians
2	culture
2	need
2	apply
4	loved
3	cool
2	last
2	found
2	creepiest
2	scariest
2	long
3	easily
3	rivaling
2	blair
2	witch
2	others
2	maud
2	roland
2	search
1	unknowable
2	haunting
2	literary
2	detective
2	labute
2	neater
2	trick
2	possession
2	language
4	sexy
2	pacino
4	brilliant
1	sleep-deprived
2	dormer
2	increasing
1	weariness
2	existential
2	physical
2	birds
2	wickedly
2	nickleby
2	thing
2	might
2	homosexual
2	undertones
2	eddie
2	murphy
2	think
2	gay
3	pops
2	nathan
2	lane
2	sophomore
1	slump
2	sam
2	mendes
3	segues
3	oscar
4	oscar-winning
3	potential
2	smooth
2	sleight
2	hand
3	inventive
2	hindsight
1	dumb
2	old-form
2	ahhhh
2	yakusho
2	shimizu
3	create
2	imamura
2	mix
2	emerge
2	clearer
2	view
2	gears
2	justice
2	grind
2	death
2	report
3	comes
2	airtime
2	alongside
2	farm
2	ruzowitzky
1	mothball-y
2	stuff
2	sturdy
2	old-fashioned
2	spite
2	housekeeping
1	unsavory
2	wwf
2	mentality
2	white
0	trash
2	roses
3	surprisingly
3	collateral
2	damage
2	finally
2	goods
2	schwarzenegger
3	marquis
2	first-time
2	paxton
2	tapped
2	frailty
2	anne-sophie
2	birot
2	feature
4	extraordinarily
2	learn
2	andrew
2	turnabout
2	fair
2	awful
2	borchardt
2	coven
4	enjoy
2	anyway
4	riveting
2	ii
2	deals
2	shadow
2	side
2	american
2	racial
2	prejudice
3	diverse
2	forms
2	tender
3	heartfelt
2	substance
1	repetitions
1	inconsistencies
2	incendiary
4	genius
2	steering
2	knee-jerk
2	quick
3	solutions
1	road
2	feasting
2	ramshackle
2	landscape
2	filmmaker
2	motherland
2	chaiken
3	evocative
3	accurate
2	observation
2	milieu
3	convincing
2	she
2	creates
3	watchable
2	huppert
2	controlled
2	display
2	vulnerability
3	ensures
2	malice
2	thoughts
2	focused
3	compliment
2	kuras
2	miller
2	i
2	thinking
2	medium
2	would
2	doing
1	wrong
2	remember
2	hoping
2	ecks
2	vs.
2	sever
2	xxx
2	prurient
2	squeamish
2	daring
1	overlong
2	examination
2	idolized
1	self-loathing
1	politics
3	truly
2	scope
2	belongs
2	four-legged
2	herbivore
0	unbearable
2	sadness
3	transcends
2	specific
2	speak
2	ways
2	presumption
2	tangle
2	sometimes
1	destroy
1	blood
2	ties
2	travels
2	arc
4	euphoria
1	disillusionment
2	auspicious
3	artistic
2	instinct
2	pushes
2	majority-oriented
2	steven
2	spielberg
2	follow
2	a.i.
2	challenging
2	liable
2	unnerve
2	majority
1	unfamiliar
2	pentacostal
3	practices
2	general
2	theatrical
2	houses
2	particular
3	eye-opener
2	waiting
2	whole
2	wait
1	dead
3	operatic
2	picture
3	entertainingly
4	magnificently
2	shot
2	sustain
2	170-minute
2	length
2	future
4	awesome
2	consider
2	period
3	detail
2	matters
2	transporting
2	stays
4	inspires
2	continuing
2	awareness
4	monumental
2	shows
2	creatures
4	breathtaking
2	scenery
2	battle
3	spectacular
2	candidly
3	detailing
2	involved
2	creation
4	extraordinary
2	jones
2	calls
2	attention
2	inherent
2	commerce
3	creativity
2	unnerving
2	recoing
2	bizzarre
3	reaction
1	unemployment
1	glum
3	interested
2	gratuitous
2	sexualization
2	haneke
2	objective
2	namely
2	implications
2	craving
1	fake
2	stimulation
4	dazzling
3	complexity
2	themes
2	piano
2	teacher
2	defies
2	categorisation
2	haunts
1	horrifies
2	startles
0	impossible
2	ah
2	yes
2	comedies
1	alienate
2	gender
2	doubtless
2	reserving
2	darkest
2	hours
2	return
2	king
3	greater
2	urgency
2	towers
2	summer
2	watch
2	arnold
2	buddy
2	gerald
2	bounce
1	bleakly
2	refusing
2	memorialize
2	themselves
2	impatient
3	admire
2	accumulates
3	crowd-pleasing
2	documentary
2	ring
4	pretty
2	english-language
2	copy
3	inspired
2	carries
2	strengths
1	flaws
3	wild
2	thornberrys
3	jolly
2	surprise
2	griffiths
2	proves
3	luminary
2	continually
2	raises
1	standard
2	profession
2	prancing
3	tailor-made
2	male
1	hooker
2	approaching
2	vitality
2	jagger
2	obviously
2	relishes
2	self-mocking
3	moment
2	offers
3	mull
2	terms
3	loyalty
2	staying
3	friends
2	reminder
2	move
2	values
1	masochism
2	binoche
3	grounded
4	riveted
2	dong
2	jie
2	documents
2	throes
2	rapid
2	change
2	fly
2	opera
4	pleasure
2	endure
2	intermissions
2	novice
3	exhilarated
2	heck
2	hearst
2	davies
3	unique
2	relationship
3	candid
2	camera
1	methamphetamines
2	subject
3	inspire
2	pianist
2	equilibrium
2	george
2	orwell
2	imagined
2	today
2	mood-altering
2	drug
2	therapy
3	envisioned
2	chemists
2	1949
3	authentic
2	bio-pic
2	hard
1	forget
2	martin
1	angry
2	sven
2	wollter
2	viveka
2	hopes
1	frustrations
3	vivid
2	moody
2	southern
2	gothic
2	practically
2	suits
2	filmmaking
3	team
2	all-too
2	inevitable
2	remake
2	weight
3	unerring
3	professionalism
2	chilly
3	fascination
2	embedded
2	lurid
2	recommendation
1	absurdist
1	alienation
2	separation
2	begins
2	terrifying
2	'm
2	stunned
2	decided
1	leave
2	light
2	night
2	tenth
2	deal
2	indeed
1	least
2	third-best
2	notch
2	previous
2	runner-up
2	nicholas
2	meyer
2	trek
2	vi
3	undiscovered
3	country
2	bourne
3	traditional
2	clouds
2	succinct
1	low-budget
2	script
2	exactly
2	missing
2	rabbit-proof
2	fence
2	contrivance
1	artificial
2	video
2	games
2	teens
2	nightclub
2	sequence
2	holm
2	embodies
3	effortlessly
3	regal
3	charisma
2	needs
3	explorations
1	alientation
2	onscreen
2	carefully
2	points
2	pat
2	resolution
2	seldom
2	closely
2	matched
2	audrey
2	tatou
2	knack
2	picking
2	roles
2	magnify
2	outrageous
2	french
3	morning-glory
4	exuberant
2	amélie
3	exuberance
2	skate\/surf
2	l.a.
2	beach
2	scene
2	illegal
2	playground
2	refuse
1	guilty
2	activity
2	statesmen
2	'd
2	sure
2	courtroom
2	trial
2	structure
3	well-honed
2	fresnadillo
3	jolting
2	images
1	plying
3	subconscious
0	nightmare
2	week
2	deftly
2	unsettling
2	younger
2	stevenson
1	perilously
2	slight
2	overall
2	gory
2	quotient
2	friday-night
2	milla
2	ramsay
2	ratcatcher
1	remains
2	acid
2	viewpoint
2	gift
1	teasing
3	poetry
2	settings
0	drab
2	sordid
2	110
3	fan
2	includes
2	segments
2	12
2	songs
3	reunion
2	concert
2	lean
1	weirdly
2	retro
1	recalls
2	raft
2	'60s
2	'70s
2	european-set
2	spy
2	pictures
1	brooding
2	room
2	gentility
2	earns
2	morton
2	body
2	morvern
2	completely
2	deadpan
2	appear
2	naked
2	deeper
2	fundamental
2	choices
2	include
2	catholic
2	doctrine
3	funny\/gritty
3	humanizing
2	woman
2	hands
2	unseen
2	forces
2	fate
3	smartest
2	singles
2	fabric
2	feelings
3	profoundly
2	deepen
2	cq
2	reflection
2	artists
2	cinema-and-self
2	suggests
2	less
2	considered
2	possible
2	successor
2	european
2	directors
2	emotions
2	raw
2	strike
2	nerve
2	trauma
2	holy
1	mad
2	maniac
2	mask
2	splat-man
2	slash-and-hack
2	unseemly
2	title
2	musketeers
2	spoof
2	fly-on-the-wall
2	method
3	document
2	rural
2	school
2	departure
2	prevalent
2	technique
2	docu-makers
2	visible
2	offbeat
2	pokes
2	democratic
2	exercise
2	examining
2	significance
2	allows
2	nolan
2	poised
2	embark
3	career
2	commercial
3	skillfully
4	hot
2	brine
2	until
1	undone
1	sogginess
1	offend
2	everyone
2	holds
2	outrageousness
3	anchored
2	friel
2	williams
3	exceptional
2	black
4	charming
2	often
2	fantasy-adventure
3	showmanship
2	clones
2	45
2	relationships
3	food
1	bumpy
2	chateau
3	cleverly
2	probes
2	cross-cultural
2	differences
2	gauls
2	yanks
2	tom
2	cruise
2	risky
2	business
3	strong
3	impression
2	underwear
2	aside
2	minor
2	tinkering
2	1994
2	except
3	high
2	evoke
2	poignance
2	confirms
2	fincher
3	status
2	maker
3	bends
2	technical
3	know-how
2	service
2	vera
2	three
2	mollà
2	gil
2	bardem
3	excel
3	insightful
3	empathetic
3	marvel
2	none
2	tightly
3	organized
2	efficiency
2	numerous
2	flashbacks
2	constant
3	edge
2	involvingly
2	adult
2	mr.
2	tsai
2	artist
2	spasms
2	mark
2	romanek
2	spotlights
2	underlying
2	caste
2	system
2	america
1	scathing
2	portrayal
3	creatively
2	constructed
2	figure
2	backstory
2	equally
2	giant
2	screens
2	heartbreaking
2	natural
3	unforced
2	entirely
1	rival
2	live
2	amuse-bouche
2	appetite
2	whetted
2	true
2	complicity
1	auschwitz
2	harrowing
2	tries
2	tell
2	unspeakable
2	steady
1	pulse
2	city
2	viewed
2	eyes
2	decrepitude
2	bones
3	luckiest
3	alive
2	macdowell
2	wifty
3	lighter
2	affairs
2	brings
2	conviction
2	role
2	easy
2	conception
3	able
2	resolve
2	confusions
2	relate
2	peace
2	dramatically
3	depicting
2	onstage
2	esther
2	quest
1	declines
2	proceeds
1	denying
2	crystal
3	claude
2	chabrol
4	thrills
2	tosca
1	unflinchingly
1	bleak
1	desperate
2	moretti
2	anatomy
2	process
2	adapting
2	intermittently
4	engrossing
2	unflaggingly
4	creative
0	convoluted
2	muddle
2	final
0	painfully
2	ode
0	bad
2	behavior
2	choice
2	charles
2	chronicles
2	seinfeld
2	stand-up
2	after
2	wrap
3	legendary
2	sitcom
1	wannabe
2	comic
2	adams
2	attempts
1	dogged
2	vain
2	jia
2	defoliation
2	ego
1	doldrums
2	stop
2	loving
2	anime
2	fanatical
2	excess
2	built
1	volatile
2	dynamics
2	unhurried
2	low-key
2	off-hollywood
3	positively
2	rhythms
3	resonance
2	densely
2	referential
2	audacious
3	comfortably
2	sit
2	jean-luc
2	godard
2	gerbosi
2	economically
2	packed
3	telling
4	brilliantly
3	comfortable
2	balances
2	lets
2	grasp
3	open-minded
3	comforted
2	destiny
2	bennett
3	naturalistic
2	speaks
2	volumes
2	anybody
2	contemplating
2	drastic
2	changes
2	messages
2	dig
2	tricks
2	rent
2	primitive
2	bubble
2	vast
3	collective
1	combatants
2	flesh
2	sheer
1	selfish
1	wound-licking
2	bar-scrapping
2	doggedness
2	transmute
1	demons
4	spirited
1	occasion
1	patchy
2	construction
3	high-spirited
2	india
2	blends
2	dance
2	song
2	imagine
2	alan
2	arkin
2	2-d
2	animation
1	timewaster
3	helped
2	presence
2	jean
2	reno
2	majidi
2	twice
2	immigrants
2	day
2	60
2	information
2	impressions
2	knowing
2	exaggeration
2	want
2	believe
3	immersing
1	endlessly
3	competitive
2	hip-hop
2	djs
2	project
4	sensational
3	revelatory
2	scratching
2	itch
3	further
2	proof
2	epicenter
2	foreign
2	smack-dab
2	middle
2	dubya
2	axis
2	evil
2	idea
2	presents
4	unforgettable
2	panache
3	gritty
2	ensemble
2	encompasses
3	potent
3	metaphor
2	dealing
2	fascist
2	puts
2	westerners
3	liked
2	homeboy
1	bizarre
2	dogma-like
2	spots
2	truthful
2	equal
2	amounts
2	naiveté
2	establishes
2	sen
2	intensity
2	strafings
2	akira
2	kurosawa
2	ran
2	savagery
2	combat
2	specter
2	visualized
2	grandeur
1	dying
2	coral
2	reef
2	money
2	jingles
2	pocket
2	lite
2	passable
2	motion
2	released
2	remembered
2	afterwards
2	minute
3	winning
2	canadians
2	sentiments
2	button
2	counterparts
2	anywhere
2	else
3	uplifting
2	wife
2	actress
2	utterly
2	sensibility
2	virtually
2	grip
2	viewers
2	cuts
2	society
2	muckraking
2	job
2	legal
2	indictment
2	fairly
3	effective
4	captivating
2	trust
2	day-lewis
2	scorsese
2	brassy
2	unusual
4	exhilarating
2	futuristic
2	thriller-noir
2	minority
2	twists
2	technology
2	delivering
3	intensifying
2	escapist
2	order
3	genuinely
2	spooky
3	above-average
2	bill
2	directing
2	americana
2	locals
2	kick
2	spotting
2	cleveland
2	sites
2	rest
3	fast-paced
2	quirks
4	award-winning
2	coen
2	brothers
2	envious
2	pumpkin
4	admirable
2	hypocrisy
2	correctness
1	uneven
1	tragedy
2	raunchy
3	college
2	ticket
4	perfectly
2	boys
2	fields
2	grown
2	stands
1	corny
1	schmaltzy
2	predictable
3	heartwarming
2	nonetheless
2	use
2	brain
2	regards
2	1967
2	key
2	turning
3	20th
2	century
2	returns
1	dissidents
2	streets
2	alarmingly
2	current
2	debuter
2	d.j.
2	caruso
2	directs
2	crack
2	bringing
2	screenwriter
2	tony
2	gayton
1	narcotics
2	noir
2	seduction
2	where
1	backstabbing
1	betrayals
3	celebrated
2	currency
2	harris
3	commands
2	using
2	suggest
2	ravages
1	corruption
1	ruthlessness
2	stephen
2	rea
2	aidan
2	quinn
2	bates
2	desmond
2	eagles
2	joined
2	brosnan
2	sight
3	grandiloquent
2	quartet
2	lolling
2	irish
4	pleasant
2	tis
2	photography
3	benoit
2	delhomme
3	delicious
2	sets
2	relatively
2	affable
2	threatening
3	illuminating
2	preconceived
2	vision
2	inhabitants
2	revealing
1	complexities
2	deliriously
1	loose
2	uninitiated
2	trademark
1	triteness
2	simplicity
2	tossed
2	window
2	concerned
2	actions
2	achieves
2	impact
2	keeping
2	these
2	hidden
2	quills
2	did
2	showing
3	colorful
3	action-filled
2	intimate
3	undisputed
2	tidy
2	hill
2	wiseman
2	socio-histo-political
2	treatise
2	earnest
2	strides
3	personal
2	illusion
1	deconstructed
1	poignancy
2	recreates
2	happen
2	car
2	chases
2	fight
2	asian
2	influences
2	liotta
2	30
2	pounds
2	transformed
3	goodfellas
2	image
2	pic
2	ilya
1	bumbling
2	vehicle
2	brian
2	palma
2	set-piece
2	target
2	youngsters
3	stimulating
2	eye
2	ear
2	candy
3	medicine
1	stiffness
3	kindness
3	hopefulness
1	grimly
3	competent
2	stolid
2	escaping
1	piccoli
2	minimalist
2	psychoanalytical
2	provocatively
2	seductive
2	weightlessness
2	james
2	horner
3	rousing
3	score
2	hefty
2	audio
2	heels
2	similarly
2	morose
0	humorless
1	flawed
2	commended
3	straight-ahead
2	approach
1	creepiness
2	noyce
2	tailored
3	economical
2	n
2	reminded
2	60s
2	preaches
2	choirs
4	amazing
3	accomplishment
2	haynes
2	absolute
2	control
2	buoyed
3	stylistic
2	juggling
2	act
2	birthday
2	girl
4	joy
1	violent
2	teary-eyed
3	appealingly
1	juvenile
2	trifle
2	smiles
2	writer-director
2	mehta
2	effort
2	tons
3	whimsy
3	intoxicating
2	masala
2	cultures
2	genres
2	draw
2	arliss
2	howard
2	onto
2	novella
2	reasonably
1	bewilderingly
2	underrated
2	campbell
2	short
2	snow
2	emergency
3	recycling
2	old
3	wants
2	tweak
3	tangy
2	smith
2	careful
3	curious
2	owners
2	architectural
2	oddities
3	respect
2	due
1	mess
2	writing
2	underneath
2	skin
2	drops
2	pressure-cooker
2	snowballs
2	focusing
2	zhang
2	done
2	getting
2	mainly
1	nonprofessional
2	midlife
2	crisis
2	lathan
2	diggs
1	slow-moving
2	parable
1	collision
2	present
2	remote
2	seacoast
2	iran
1	fat
2	greek
1	stereotypes
4	lovingly
2	dished
2	kept
2	aloft
2	largely
3	comically
3	adept
2	sort
2	hitchcock
3	optimistic
2	serry
4	remarkable
2	storytelling
3	atom
2	egoyan
2	conjured
3	multilayered
2	tackles
2	number
2	essentially
3	exceptionally
4	well-written
3	well-edited
3	well-directed
2	bald
0	rip-off
2	aliens
3	veritable
2	source
3	sincere
2	orbits
1	unsettled
2	pace
2	seemingly
2	opaque
4	satisfy
2	moviegoer
3	soaringly
3	transparently
2	hardly
3	introduces
3	charitable
2	enterprise
2	devilishly
2	heather
2	mcgowan
2	niels
2	mueller
2	expense
2	somewhat
1	clumsy
1	lethargically
2	paced
2	creature
2	psychic
2	abilities
2	build-up
3	climax
3	nice
2	chills
2	wondered
2	ending
3	input
2	executives
2	test
2	audiences
2	direct
2	imagery
2	toes
2	anne
2	fontaine
1	nervous
1	breakdown
1	lacks
2	focus
2	corcuera
2	seeds
4	thoughtful
2	conflicted
3	quality
2	combined
3	intelligence
2	biblical
2	forgiveness
2	syrupy
1	thirsty
2	taking
3	qualities
2	estrogen
2	overdose
3	divine
2	secrets
2	ya
2	sisterhood
2	punch
3	well-detailed
3	enriched
2	manners
2	mores
2	holes
3	pleases
2	sees
2	taut
1	waste
2	two-hour
2	offer
2	punch-drunk
1	heavy-handed
1	jabs
2	employs
2	placed
2	dead-center
2	bent
2	drum
1	repressed
2	teenage
2	memories
2	viewer
2	blanchett
2	tracking
2	breadth
2	intimacy
2	meaning
3	distinguishes
3	favor
2	countless
2	thrillers
2	concern
2	words
2	complicated
3	fueling
1	terrorist
2	acts
3	provocative
2	blisteringly
1	sacred
3	gut-buster
1	threatens
2	unexpected
2	twist
2	moods
3	treasures
3	marvels
2	mild
2	clashing
2	delhi
2	soderbergh
2	solaris
0	failure
4	glorious
3	bright
2	modern
1	wears
2	sleeve
2	scattershot
1	affair
2	hits
2	intellectual
2	underpinnings
1	maddeningly
2	featuring
2	dangerously
2	auteuil
2	covers
2	kaufmann
2	unsettlingly
2	results
4	spellbinding
2	african
2	condition
2	rootlessness
2	state
3	experienced
2	millions
2	globe
2	improvise
2	jazzman
3	multi-dimensional
2	sci-fi
2	mystery
2	germinate
4	well-made
4	giggle-inducing
3	snappy
3	oscar-winners
3	susan
2	sarandon
2	goldie
2	hawn
2	decades
2	schlepping
2	indiana
2	misplaced
2	ashtray
2	wilde
3	importance
2	19th
2	relentless
4	polished
2	withstand
1	inept
2	oliver
2	adaptation
2	laying
2	encounter
2	following
2	demands
2	tradition
2	peculiar
3	promise
2	al
1	loathing
2	robin
2	next
1	mob
2	low
2	godfather
2	stooges
2	lan
2	yu
2	restrained
2	captures
2	erotics
2	stories
2	downright
1	unfree
2	thinly
2	veiled
2	aspects
2	chinese
2	\/
2	several
2	warp
2	speeds
2	levels
2	dilithium
2	crystals
1	pitiful
2	insurrection
3	predecessors
2	must
2	retold
2	grey
2	zone
3	lauded
4	ingenious
2	angle
2	lion
2	roaring
3	success
2	eight
2	imax
3	bigger
2	played
2	understated
2	plays
2	large
2	measure
2	anspaugh
2	actresses
4	inspirational
2	screenplay
3	rich
2	ground
2	mainstream
3	suitable
2	entry
2	fest
2	circuit
2	niccol
2	demonstrates
2	understanding
2	healthy
2	satire
2	manga-like
3	heroine
1	fights
1	abusers
2	confirming
3	artful
2	within
2	confines
3	well-established
2	unconventional
2	storyteller
0	depressing
2	places
2	richard
2	gere
2	diane
2	martinez
2	figures
2	surrounding
2	bobby
2	mosaic
2	sits
2	relation
1	demented
2	kitsch
1	smeary
2	digital
2	match
1	muddled
3	savvy
2	celebrity
3	guts
3	open
4	outstanding
3	appreciated
2	sailors
2	folks
2	all-in-all
2	frankly
2	necessarily
2	pertinent
2	cinematically
2	scored
4	perfection
2	myself
1	struggling
2	finger
2	elusive
2	anarchic
2	non-stop
2	techno
3	overtones
2	kieslowski
2	maelström
2	winter
2	sleepers
2	nicks
1	uncertain
2	gamut
2	stale
2	parody
2	gags
2	sketch
2	full-length
3	written
2	pass
2	entrance
2	exam
2	kicks
2	hartley
1	distended
1	foot-dragging
2	e
2	ventually
2	flushed
2	latrine
2	heroism
2	am
2	sorry
1	unable
2	brunt
2	telegraphing
1	obvious
2	simplistic
3	suited
2	resembles
2	grease
3	benefit
2	indifferently
1	implausible
3	popcorn
2	programmer
1	inoffensive
4	cheerful
2	set
1	unending
2	party
2	pop
2	numbers
2	camerawork
2	sunburn
2	premises
1	hackneyed
2	plain
1	crude
2	calculated
2	shocked
4	laughter
2	christina
2	ricci
1	misfire
3	palpable
2	crux
2	hinges
2	technicality
1	strains
2	credulity
2	leaves
2	haunted
2	called
2	gutterball
2	thekids
2	stay
3	amused
2	kaleidoscope
2	mom
2	dad
2	catch
1	naptime
2	self-important
1	plodding
2	clipped
2	abbreviated
2	scottish
2	ritchie
1	dizzy
2	jaunt
2	slick
3	cross-promotion
2	taylor
1	blown
2	budget
3	rights
2	left
2	jokes
2	believes
3	truths
2	churning
2	passed
3	fertile
1	drags
2	interminably
0	miserable
2	unfold
2	villeneuve
2	spends
2	wallowing
2	bibi
1	generic
2	angst
2	shots
2	gazing
2	windows
2	florid
1	overplotted
2	rice
2	rock
2	'n'
2	roll
2	vampire
2	built-in
1	silliness
2	defeats
2	photographed
2	lighting
2	indie
2	naturalism
2	tux
2	hewitt
2	design
0	cheap
1	knockoff
3	recommend
2	rental
2	tuxedo
1	headache
0	meaningless
0	downer
2	apart
2	everything
2	blue
2	crush
1	flat
2	detox
0	pointless
2	endeavor
2	van
2	wilder
2	proverbial
2	table
2	possess
2	coherence
2	absent
1	crass-a-thons
2	tomcats
2	freddy
2	fingered
2	slackers
2	piquant
3	dramatic
2	meat
3	bold
2	heightened
2	hide
2	achilles
2	heel
2	stuart
2	2
2	combines
2	blues
3	famous
2	bears
2	g
2	rating
0	excruciating
2	dollop
2	mixed
2	load
2	junk
2	michell
2	notting
2	scary
2	child
2	suffer
2	embarrassment
2	vague
1	shame
2	accumulated
2	knot
2	tightening
2	symptom
1	malnutrition
2	green
2	mohawk
2	sheet
2	fire-red
2	flame
2	tattoos
2	covering
2	shoulder
2	kilmer
2	posing
2	hole
2	center
2	salton
2	deriding
2	bond
1	clichéd
1	doddering
1	misogynistic
2	boy
2	club
2	ended
2	felt
1	tired
2	drained
2	wanted
1	lie
1	deathbed
1	witless
2	outrageously
3	unbelievable
2	scenarios
1	saddled
1	misogyny
2	thin
2	nonexistent
1	pretentious
2	iditarod
2	lasts
2	days
2	after-school
2	gussied
3	fancy
2	rote
2	connect
2	egg
1	timer
2	93
1	maddening
2	conveys
2	willfully
1	overwrought
2	incomplete
2	starts
2	corner
1	marginal
2	historical
2	venice
2	etc.
2	lower
2	expectations
1	leukemia
2	looked
2	shimmering
2	benign
1	arthritic
2	attempt
2	callie
1	less-than-magic
2	kingdom
2	reese
2	rules
2	velocity
2	represents
2	independent
2	commodified
3	sold-out
2	unnecessary
2	swimfan
2	moonlight
2	replete
3	acclaimed
2	self-conscious
2	reach
2	hovers
2	somewhere
2	acute
1	trite
2	corpus
2	collosum
2	undeniably
3	wore
2	credits
2	rolled
2	20
2	redeeming
2	road-trip
1	drek
1	fart
2	guy
1	unlikeable
3	shiner
2	starring
2	caine
2	boxing
2	promoter
2	fortune
2	by-the-numbers
3	enhance
2	involves
2	mysteries
2	badly
2	outcome
2	pilot
2	buyer
2	tube
2	lesser
2	harrison
2	ford
2	six
2	seven
2	nights
0	dreadful
2	sabrina
2	translation
2	evidence
2	contrary
1	clunker
2	somehow
2	managed
2	pose
2	actual
3	charges
2	admission
2	hyped
2	purports
2	ostensible
2	unclassifiably
2	self
0	audience-abuse
2	impostor
2	stretching
3	padding
2	material
2	blur
1	distracting
2	hey
2	40
3	appreciation
2	depend
3	definitely
1	skip
2	fanatics
1	excessive
1	profane
2	cartoonish
2	comic-strip
2	50
2	benigni
2	ourselves
2	longing
2	block
2	wood
2	working
2	heartstring
2	untugged
2	liberal
2	cause
1	unplundered
3	succeeds
2	instilling
2	wary
2	simply
2	floating
1	farce
2	sliding
2	doors
1	failing
2	exploit
1	strange
2	laziness
3	talents
2	robert
2	forster
2	meara
2	eugene
2	levy
2	reginald
2	veljohnson
3	hilarity
1	same-old
1	lame-old
2	slasher
1	nonsense
2	turkey
2	49-year-old
2	roberto
2	wooden
2	pinocchio
2	cowrote
2	starred
2	borders
0	grotesque
2	ga-zillionth
1	airhead
2	distress
2	resorts
2	measures
2	zaidan
2	barely
3	string
2	stunts
2	characterization
2	faces
2	straight
2	try
2	single
2	reason
2	group
2	extemporaneously
2	shouted
2	thank
2	leguizamo
2	plugged
0	irritating
2	late
2	focus-grouped
1	tedium
2	alchemy
2	produces
3	gold
2	treats
0	idiots
2	leaks
2	average
3	comedic
2	dateflick
0	valueless
2	kiddie
3	paean
2	pro
2	basketball
2	underwritten
2	nba
2	handful
2	starters
2	slim
2	facile
3	cute
3	festival
2	experiencing
2	sampling
2	materials
2	dresses
2	california
2	locations
3	swaggering
3	camaraderie
1	gore
2	spell
2	cliché
2	harmless
2	fishing
2	dinner
1	forced
2	host
2	hostess
2	home
2	baby
2	learned
2	salvage
2	lifeless
0	unfocused
1	underdeveloped
2	15
2	giggle
2	happens
2	blow
2	potatoes
3	10
2	ai
3	needed
2	chest
0	worst
3	champion
1	loser
2	earth
2	guffaw
2	diabolical
2	ships
2	insights
2	price
2	pays
1	dishonest
2	chokes
2	depiction
2	upper-crust
2	decorum
3	well-nigh
0	unendurable
2	depressingly
2	prosaic
0	dull
2	stopped
2	slogged
2	allodi
2	nolden
2	performers
2	sunk
2	mechanics
2	directorial
2	show-off
2	higuchinsky
2	flash
2	ballistic
3	silly
2	unless
2	raising
2	eyebrows
2	longer
1	worse
2	hear
2	talk
2	early
2	records
2	sugar
2	gang
2	referencing
2	arcana
3	savviest
1	unfunny
1	repellent
3	care
1	menace
2	embraces
2	fuhrman
1	destructive
2	escapism
3	grace-in-rebellion
1	condescending
2	innocuous
2	fill-in
2	the-blanks
2	k-19
2	exploits
2	substantial
2	fear
2	nuclear
0	holocaust
2	generate
2	fidget
2	ten
2	pseudo-serious
1	deleted
2	montage
1	awkward
2	silence
1	ragbag
0	failed
2	whaley
2	determination
2	immerse
2	unrelenting
0	wretchedness
2	exhausting
2	uncommonly
0	fails
2	ask
2	searching
2	justify
2	pretensions
0	boring
1	sad
2	convolutions
2	jerking
1	nagging
2	suspicion
2	ethan
2	hawke
2	behind
2	front
2	discernible
2	craft
1	monstrously
1	sanctimonious
2	childhood
2	unremarkable
2	soft
2	holden
2	caulfield
2	synthesis
1	absurdities
2	decadent
1	emptiness
2	oh
1	rotting
2	miles
3	coherent
2	fluff-ball
2	bees
2	knees
2	fisticuffs
2	stop-go
1	slow
2	rumbles
2	streamed
2	28k
2	modem
4	spectacularly
1	misconceived
3	sophisticated
2	cinephile
2	perpetrated
2	odd
1	confusing
2	centered
1	weird
2	carvey
2	saturday
2	live-honed
1	mimicry
2	rises
2	jacquot
2	rendering
2	puccini
2	devotion
2	stab
2	sporadically
2	somber
2	1978
1	weak
2	unearthed
1	weaker
2	territory
4	clever
2	killers
2	space
2	melodramatic
1	toxic
2	stretched
2	evaporation
2	central
2	section
2	chase
3	goal
2	filler
2	sacrifices
2	value
3	wealth
2	archival
2	foot-age
2	less-than-objective
2	stance
1	lacking
2	invention
3	astonishingly
1	hamfisted
1	hapless
2	facilitator
2	extended
2	mason-dixon
2	scores
3	originality
2	cookie-cutter
2	cut-and-paste
1	gasp-inducing
2	occasions
2	narrator
2	stops
1	yammering
2	unsure
2	means
2	fraternity
2	ambitions
3	exceed
2	writer
2	adam
2	larson
2	broder
2	co-director
2	r.
2	abrams
2	campy
2	vincent
2	classics
1	implodes
2	opening
2	benjamins
2	totally
1	formulaic
2	qualify
1	expected
2	ship
2	jesse
2	ventura
2	xfl
4	impeccable
0	preposterous
3	precious
1	murder
2	including
2	wrapped
2	visuals
2	eccentricities
1	confused
2	came
2	reacting
2	wincing
1	repugnance
2	dilbert
3	right-on
2	satiric
1	banality
2	intention
2	opposite
3	indicates
2	tarted
2	latin
2	flava
2	playas
2	leftover
2	enron
2	stock
2	double
2	friday
2	call
0	appalling
2	underestimate
2	entertainments
2	89
2	sitting
3	igloo
2	51
1	sank
0	jerky
2	utter
2	multi-million
2	dollar
1	con
2	bothered
2	problems
2	spookiness
2	lake
2	camp
2	gone
2	compiled
2	minus
3	daytime
2	programs
2	slickness
2	sophistication
2	knew
3	resident
2	standards
2	third
2	close
2	terminally
1	depressed
1	inarticulate
2	hyper
1	dysfunctional
2	families
2	amoses
2	andys
2	val
2	personas
2	caring
2	suspect
2	appearing
3	lighthearted
1	offends
1	wishy-washy
2	produced
2	guessing
2	spray
2	cheese
2	underarm
2	noises
2	crucial
2	harland
2	permanent
2	sex-reassignment
0	lame
2	kung
3	pow
3	funnier
2	martial
2	arts
2	oedekerk
1	impish
2	augmentation
2	stretches
3	meal
2	preparation
2	objectionable
2	merely
2	intentions
2	science-fiction
2	pastiche
2	stripped
2	inspirations
2	kim
2	overplay
2	shock
2	tactics
2	bait-and-tackle
2	metaphors
2	decide
2	pay
2	postcard
2	dear
2	mother
3	amped-up
2	hawk-style
2	thrashing
2	rap-metal
2	disguise
2	fact
2	britches
2	unremittingly
2	labeling
3	dog
2	constitutes
2	cruelty
2	canines
2	co-opted
2	frequently
3	pedestrian
2	perplexing
2	example
1	unfulfilled
1	writhing
2	wailing
1	opium
1	overdoses
2	washed
1	dissolution
2	coarse
2	gross-out
2	date
1	half-formed
1	disservice
2	critical
2	distance
2	bumper
2	sticker
2	platitudes
2	besides
1	glib
1	soullessness
2	pieces
2	raise
2	bar
2	stylized
3	decides
2	lavinia
2	conservative
2	route
2	pussy-ass
2	killer-thrillers
2	revolve
2	sessions
2	stripped-down
4	timeless
2	measured
2	inflection
2	subjects
2	obscured
2	stationary
2	mistaken
2	giving
2	oration
2	contributing
3	spice
2	paid
3	vibrant
2	clips
2	scarface
1	cheat
2	flowers
2	brains
1	re-do
0	exploitative
2	ironically
2	railing
1	rehashed
1	insipid
1	vulgarity
2	dawn
2	crossed
2	john
2	carpenter
2	ghosts
2	mars
2	zombies
2	ghoulish
2	trains
2	basically
2	semi-improvised
2	semi-coherent
2	raps
2	freak
2	mercenary
3	cerebral
2	isle
2	categorization
2	unpredictable
2	gal-pal
2	bites
2	considerably
2	mckay
2	swallow
2	stoic
2	get-out
2	intimidate
2	machine
1	bored
1	joke
3	gymnast
3	embellishing
1	misanthropic
2	soap
1	vapid
1	insensitive
1	hurting
3	feature-length
2	marriage
3	saved
2	columns
2	ladies
2	journal
2	meet-cute
2	yourself
2	matter
2	socrates
2	motions
2	hemlock
3	gifted
2	walter
1	pulpy
3	overcomes
1	questionable
2	in-the-ring
2	match-up
2	choreography
2	prison
2	authenticity
2	eating
2	oatmeal
2	scares
3	abundance
1	satanic
2	shake
2	severed
2	limb
2	bet
1	nemesis
2	meekly
0	wince-inducing
2	thrift-shop
2	prosthetic
2	makeup
1	putty
2	kmart
1	blue-light-special
2	conspire
2	trekkie
2	abstract
2	statement
2	prewarned
2	person
3	tidal
2	wave
2	heartstrings
2	pulled
1	fool
2	thorn
2	vinegar
2	humanity
2	plundered
2	similar
2	conspicuously
4	impressive
2	craftsmanship
1	overbearing
2	third-act
2	crescendos
2	lily
2	chou-chou
2	builds
2	steam
1	fooled
2	release
1	painful
2	stoke
2	conversation
1	w
2	magazine
2	spread
2	swept
2	rug
2	mad-libs
2	explanation
3	hilariously
1	ridiculous
2	prowess
3	smoothes
2	uncovers
1	shapeless
2	blob
2	produce
2	transgressive
2	underground
2	portent-heavy
2	patient\/doctor
2	usual
2	stealing
2	harvard
3	aspires
1	larceny
2	convicted
1	petty
1	theft
2	pretension
3	bravery
3	steadfast
1	hoity-toity
2	convictions
2	chelsea
2	walls
2	medal
2	exception
2	fleetingly
3	improvisations
2	cedric
2	entertainer
2	perry
2	boss
2	grab
2	bag
2	ready
2	o'fallon
2	contributed
2	intent
2	monty
4	delight
2	convict
0	heinous
2	chef
2	hotdog
1	trashy
2	cop
1	falseness
2	began
2	youth
1	fizzles
3	heart-tugging
2	stick
2	tune
3	free
2	hostages
2	hostage
3	affectation
2	seriousness
2	aesthetics
2	evincing
2	percolates
1	monotonous
2	whine
2	maudlin
1	egotistical
2	daughter
2	dario
3	argento
2	producer
3	fearlessness
2	magnetic
3	ultimate
2	depression-era
1	gangster
2	pr
2	hype
2	function
2	according
3	believable
2	impulses
2	license
2	avary
2	uncomfortably
2	coasting
2	treads
2	bicycle
2	thief
3	handsome-looking
0	bore
2	planet
2	reimagine
2	farrelly
2	bros.
2	peter
2	brand
1	wheezing
1	half-hearted
2	path
2	related
2	robots
1	butchered
2	rollerball
3	laughed
2	loud
2	talking
3	slapstick
1	problem
1	mediocre
3	dynamic
2	duo
2	marquee
3	satisfaction
2	buffoonery
2	tickle
2	preschooler
2	costs
2	four
2	$
2	spend
2	pedigree
2	unforgivably
2	fortified
2	tooth
2	notion
0	bombing
2	buildings
4	funniest
2	unexamined
3	startlingly
2	word
0	disappointment
3	poetically
2	indelible
2	kinda
2	qualifies
3	sustains
3	dreamlike
2	glide
2	succession
1	cheesy
2	coincidences
2	voluptuous
2	rebecca
3	romijn-stamos
1	diluted
2	haphazard
2	writers
2	mistakenly
3	achieve
1	frantic
2	tossing
3	stirring
3	pot
3	chuckle
3	complete
1	misses
3	amazingly
3	lifelike
2	tara
2	reid
2	skills
2	comparable
2	cardboard
2	cutout
2	dreamed
2	attending
2	cannes
2	vintage
2	87
1	halfhearted
2	cautionary
1	fatal
2	attraction
2	=
1	nutjob
2	unfaithful
2	married
2	workshop
3	prevails
3	enjoyed
3	enjoys
2	primarily
2	uwe
2	boll
2	provide
1	scant
2	throwback
2	hile
3	amiable
2	monkeys
2	environmentalism
2	goodall
2	chimpanzees
2	oversize
2	outer-space
2	buffs
2	intermittent
2	channel
2	5
3	grade
1	insult
2	limp
2	fish-out-of-water
1	bloated
1	gasbag
2	thesis
0	grotesquely
4	impressed
2	gargantuan
3	aura
3	self-importance
3	mighty
2	contend
1	unpleasant
2	hit-and-miss
2	awkwardly
2	staged
1	rumor
2	angels
1	sudsy
2	tub
2	supernatural
2	ms.
2	redgrave
3	noblest
2	efforts
2	redeem
1	hopeless
2	friend
2	playboy-mansion
3	laugh-out-loud
0	ludicrous
2	relentlessly
2	brutally
3	perdition
2	meanwhile
2	reads
3	driving
2	daisy
3	promisingly
2	towards
2	attacking
2	bid
2	tv-to-movie
2	big-screen
2	nervy
3	groundbreaking
2	small-screen
2	progenitor
2	madonna
2	lagoon
2	textural
2	gloss
2	sex-as-war
2	strictly
2	burns
2	harnesses
1	overemphatic
2	would-be
1	wading
2	pool
2	burly
2	coincidence
2	pummels
2	necessity
1	drunken
2	roundhouse
1	whatever
2	passes
2	device
2	standing
1	so-inept
2	dubbing
2	voices
2	glenn
2	regis
2	philbin
2	breckin
2	flicks
2	monster
1	disposable
2	tissue
2	card
2	turturro
3	fab
2	butler
2	foot
2	fetish
2	lays
2	thick
1	suicide
2	race
2	professionally
2	tempting
2	jump
2	january
2	schlock
0	shoddy
2	nelson
0	sucks
2	leaving
1	horrific
1	unemotional
1	disturbingly
2	close-up
1	damaged
2	psyches
2	undercurrents
2	danger
2	breaking
1	half-baked
2	overheated
2	finding-herself
2	uncover
2	mouse
2	cryin
2	milk
2	despondent
2	nobody
3	ambition
2	helping
2	stir
2	ingredients
2	heavy
2	course
2	measurements
2	valedictorian
2	landings
2	claims
2	thousand
2	took
2	sympathize
2	conveying
2	issue
2	momentary
3	escape
2	heat
1	sedentary
2	pie
2	valium
1	amateurishly
2	assembled
2	blooper
2	reel
1	inexorable
2	passage
2	toward
1	sainthood
2	windtalkers
2	sticky-sweet
4	melodic
2	abc
2	kiarostami
1	aids
2	africa
2	aspirations
2	social
2	import
2	inform
1	shameless
2	sham
2	cash
2	popularity
2	art-directed
1	unengaging
1	yikes
2	uproarious
2	superficial
2	arthouse
2	middle-brow
2	please
2	crowd
1	undetermined
0	vulgar
1	banal
2	pacing
2	get-go
2	rodriguez
2	reserve
1	whiny
2	corruscating
2	commentary
1	suffocated
1	fussy
1	uptight
1	musty
0	annoying
2	packaged
2	sold
1	coughs
2	sputters
2	postmodern
1	conceit
2	wildly
1	inconsistent
2	dvd
2	player
2	teen
2	skids
2	shamu
2	whale
2	swim
2	somebody
2	spliced
2	random
3	chris
2	routine
1	cliche-riddled
2	self-serious
2	clowns
2	100
2	%
2	elemental
3	literacy
2	inkling
4	genuine
2	paint
2	makhmalbaf
2	background
2	color
2	mick
1	cliche
1	unturned
2	dress
2	rehearsal
2	off-kilter
2	affectionate
2	loopiness
2	seemed
2	congenital
2	demme
2	perspective
2	tough
2	emerging
1	dated
3	cutesy-pie
2	scenario
2	newfangled
2	post-production
3	virtuosity
2	mired
1	near-xenophobic
2	pedagogy
2	pine
2	handle
2	rigors
2	chai
2	encourages
2	rueful
2	indian-american
2	lesson
2	wrench
2	toss
1	weaknesses
3	trails
2	inconsequentiality
2	marching
2	stomping
2	clown
2	clothes
2	football
1	untuned
2	instruments
2	devoid
2	intelligible
2	treatises
2	combining
2	quick-cut
2	editing
2	blaring
2	metal
2	beck
3	dragonfly
2	atmosphere
2	costner
1	flailing
1	buggy
2	establish
2	rounded
2	particularly
2	switches
2	link
2	tenuous
2	purport
2	span
2	125-year
2	divide
1	nonsensical
2	cyber-horror
2	hiding
2	critics
2	miramax
1	repulsively
1	sadistic
1	mundane
3	lift
2	ought
2	ed
2	revoked
2	matt
2	damon
2	ben
2	residuals
2	officially
2	completes
2	hunting
2	trilogy
2	planned
2	whereas
2	beast
3	revitalize
2	outing
2	parade
1	gibberish
2	advance
2	linux
2	ski
1	robbery
1	infantile
2	changing
2	diapers
2	tok
2	andy
2	lau
3	sleek
1	sociopath
2	trail
2	o
2	takashi
2	sorimachi
2	hitmen
1	paint-by-numbers
2	manner
3	imminently
2	besson
2	earlier
1	lackluster
1	unessential
2	j.m.
2	barrie
2	pan
2	samira
2	blackboards
2	ethos
2	stream
2	consciousness
2	unfortunate
2	reflections
2	torpid
2	demonstrate
2	clout
2	sweep
2	u.s.
2	feet
2	street-realist
2	mode
2	self-regarding
2	trips
2	intrinsically
2	sir
2	anthony
3	hopkins
2	saying
0	bitch
2	jerry
2	bruckheimer
1	hampered
2	lifetime-channel
2	shall
0	dread
2	apprehension
2	executed
2	perfunctory
2	implies
2	strangers
2	forever
1	collapses
1	shaky
2	foundation
2	wish
1	clumsily
2	plotted
1	shallowly
2	characterized
2	sticky
3	plotting
2	rosily
1	myopic
2	wwii-era
2	mississippi
2	delta
2	undermine
1	kill-by-numbers
1	blade-thin
1	terrible
2	pun-laden
2	alabama
2	bummer
2	turn
2	partway
2	saccharine
2	easter-egg-colored
2	concoction
2	realize
2	episodes
1	rejected
2	recruitment
1	sellouts
2	portentous
2	appropriately
2	titled
1	heavy-handedness
2	fitfully
2	romp
2	malcolm
3	pubescent
2	frankie
3	muniz
2	jason
2	x
1	anti-darwinian
2	sequels
2	400
2	later
4	wiser
2	kills
2	auto-pilot
2	sun
2	east
2	derrida
2	elysian
0	idiotic
2	absurdly
3	sentimental
2	chick
2	resorting
1	string-pulling
3	legitimate
2	sterility
2	setting
2	swing
2	yields
2	whiff
2	mystery\/thriller
2	denis
2	o'neill
2	avoids
2	sports
2	last-second
3	win
3	championship
1	neglects
2	zigzag
3	sufficiently
3	developed
2	support
1	undercut
1	amateurish
2	serving
2	sara
2	serve
2	hopelessly
3	noteworthy
1	gimmick
2	unbroken
2	87-minute
2	elements
2	triple-espresso
2	endurance
2	challenge
1	deadeningly
2	jargon
2	stiff-upper-lip
1	laboriousness
2	filth
2	denizens
2	burdette
2	collage-form
2	tends
2	over-romanticize
3	spiritual
1	desolation
2	artiste
2	episode
2	crypt
2	mistake
2	apparent
3	virtue
2	in-your-face
2	wallow
2	depths
2	sung
2	close-ups
2	turkey-on-rolls
2	stubbly
2	chins
2	liver
2	noses
2	bobbed
1	chuckles
2	nowhere
2	patched
3	cleverness
2	hurley
2	breathe
1	disjointed
2	jay
2	scherick
2	ronn
2	hudlin
2	akin
2	alice
2	glass
2	seriously
2	lived
3	believability
2	compensate
1	incessant
2	coarseness
3	ups
2	downs
2	accompany
2	lifelong
2	friendships
2	fewer
2	viewing
2	sum
2	exhilaration
1	showcases
1	taxing
2	drop
3	patience
1	stultifyingly
1	dumbfoundingly
1	mind-numbingly
2	reawaken
2	discussion
2	kennedy
1	assassination
2	fictional
2	cable
2	settle
2	imposter
0	distasteful
2	kidnapping
2	dramas
2	doomsday
2	result
2	gaudy
2	halloween
1	died
3	davis
3	enamored
0	insufferable
1	bliss-less
2	groans
2	comment
2	throws
2	curves
2	mercy
2	squarely
2	specifically
2	expounded
2	via
2	computer
2	testament
2	jonah
3	bouncy
2	musicals
2	fused
2	triangle
1	worn
2	required
2	sell
2	doodle
2	conscientious
2	potion
2	named
2	blossom
2	bubbles
2	buttercup
2	laser-beam
2	enable
2	discern
1	flimsy
2	screenplays
3	perceptive
3	nascent
2	industrialized
2	ill
3	fit
2	verbinski
2	implements
2	hack-artist
2	ooky-spookies
2	mcconaughey
1	dragons
2	unwise
2	amalgam
2	broadcast
2	news
2	vibes
2	skins
2	yawp
2	grains
2	salt
2	ole
2	returning
2	aggressively
1	dimwitted
2	dimmer
3	sandler
2	executive
2	vehicles
3	sassy
2	exists
1	cliched
2	mattei
1	tiresomely
1	grave
1	long-winded
2	circularity
2	indicated
3	profundity
1	robbed
2	element
2	huge
1	irresponsible
2	cops
2	pranks
2	whenever
2	bogged
2	involving
2	cia
2	satellite
2	hunter
2	irwin
